{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Data Science with Neo4j Using Yelp Data"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Module 2: Segmentation and Community Detection (Work in Progress)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Goal: Find communities based on categories of restaurants users review      \n",
    "\n",
    "Algorithm: Label Propagation\n",
    "\n",
    "High Level Approach:\n",
    "      \n",
    "- Subset data to only include restaurants in Toronto.  Consequently, this means we are only considering users who reviewed restaurants in Toronto.\n",
    "- Population:  66,639 users, 2963 businesses, 94 categories\n",
    "- Relationships: user REVIEWED business, business IN_CATEGORY, user REVIEWED_CATEGORY\n",
    "- Create weights between users to form tighter communities (jaccard index between users based on # restaurant categories)\n",
    "- Draw parallels with traditional data science clustering approaches (eg: k-means, kNN)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "from neo4j.v1 import GraphDatabase, basic_auth\n",
    "import pandas as pd\n",
    "import matplotlib.pyplot as plt\n",
    "import os"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "uri  = os.getenv('NEO4J_URI',  'bolt://localhost:7687')\n",
    "user = os.getenv('NEO4J_USER', 'neo4j')\n",
    "pwd  = os.getenv('NEO4J_PWD',  'neo4j')\n",
    "\n",
    "driver = GraphDatabase.driver(uri, auth=basic_auth(user, pwd))"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Part 1: Compute Jaccard index between user pairs"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CPU times: user 2.28 ms, sys: 2.39 ms, total: 4.67 ms\n",
      "Wall time: 9.47 s\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "\n",
    "# first, create relationship between users and categories.\n",
    "query = \"\"\"\n",
    "        MATCH (u:User)-[:REVIEWED]->(b:Business)-[:IN_CATEGORY]->(c:Category)\n",
    "        WITH u, c, COUNT(DISTINCT b) as num_business\n",
    "        CREATE (u)-[:REVIEWED_CATEGORY {num_reviewed: num_business}]->(c)        \n",
    "        \"\"\"     \n",
    "\n",
    "with driver.session() as session:\n",
    "    result = session.run(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'COUNT(r)': 474179}]"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CPU times: user 4.74 ms, sys: 2.5 ms, total: 7.24 ms\n",
      "Wall time: 26.1 ms\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "\n",
    "# count number of REVIEWED_CATEGORY relationships\n",
    "query = \"\"\"\n",
    "        MATCH ()-[r:REVIEWED_CATEGORY]->()\n",
    "        RETURN COUNT(r)\n",
    "        \"\"\"     \n",
    "\n",
    "with driver.session() as session:\n",
    "    result = session.run(query)\n",
    "    \n",
    "result_df = [dict(record) for record in result]\n",
    "display(result_df)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style>\n",
       "    .dataframe thead tr:only-child th {\n",
       "        text-align: right;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: left;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>id</th>\n",
       "      <th>num_category_reviewed</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>0P_wUAKVI8HfKxb4OAHOHA</td>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>X_7WEtz0cPkUBFSGjRz9pg</td>\n",
       "      <td>14</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>vrDr2a7ECpZOHlPGY7tnUA</td>\n",
       "      <td>6</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>XpykVM_2W9LWPyP1S8wu4A</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>w0WY5LJVTdAXjpWKJJPbnQ</td>\n",
       "      <td>6</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                       id  num_category_reviewed\n",
       "0  0P_wUAKVI8HfKxb4OAHOHA                      3\n",
       "1  X_7WEtz0cPkUBFSGjRz9pg                     14\n",
       "2  vrDr2a7ECpZOHlPGY7tnUA                      6\n",
       "3  XpykVM_2W9LWPyP1S8wu4A                      1\n",
       "4  w0WY5LJVTdAXjpWKJJPbnQ                      6"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CPU times: user 2.7 s, sys: 55.3 ms, total: 2.75 s\n",
      "Wall time: 3.39 s\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "\n",
    "# get distribution of number of categories reviewed by user\n",
    "query = \"\"\"\n",
    "        MATCH (u:User)-[r:REVIEWED_CATEGORY]->()\n",
    "        RETURN u.id as id, COUNT(r) as num_category_reviewed\n",
    "        \"\"\"     \n",
    "\n",
    "with driver.session() as session:\n",
    "    result = session.run(query)\n",
    "    \n",
    "result_df = pd.DataFrame([dict(record) for record in result])\n",
    "display(result_df.head())"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "image/png": "iVBORw0KGgoAAAANSUhEUgAAAYcAAAD8CAYAAACcjGjIAAAABHNCSVQICAgIfAhkiAAAAAlwSFlz\nAAALEgAACxIB0t1+/AAAESFJREFUeJzt3X+s3XV9x/Hna60o6hCQu4a1sLLYzFQSARuo0SwOJhQw\nlj+UQdxoCLN/iBkuLq74D/EHCSSLKImSEOgsxokENTRa7RrAbPsDbBEHAhLuEKQN0Gr5oTPC0Pf+\nOJ9ux35ue09Le0977/ORnJzv9/39fL/nc7799r7u9/v9nHNTVUiSNOwPxt0BSdKhx3CQJHUMB0lS\nx3CQJHUMB0lSx3CQJHUMB0lSx3CQJHUMB0lSZ/64O7C/jjvuuFq8ePG4uyFJh4377rvv51U1MUrb\nwzYcFi9ezJYtW8bdDUk6bCR5ctS2XlaSJHUMB0lSx3CQJHUMB0lSx3CQJHUMB0lSx3CQJHUMB0lS\nx3CQJHUO209IvxqL13xnLK/7xDXnj+V1JWlfeeYgSeoYDpKkjuEgSeoYDpKkjuEgSeoYDpKkjuEg\nSeoYDpKkjuEgSeoYDpKkjuEgSeoYDpKkjuEgSeqMFA5JnkjyYJIfJdnSascm2ZTksfZ8TKsnyfVJ\nJpM8kOS0oe2sau0fS7JqqP6Otv3Jtm4O9BuVJI1uX84c/qKqTqmqZW1+DXBnVS0B7mzzAOcCS9pj\nNXADDMIEuAo4AzgduGpXoLQ2Hx5ab8V+vyNJ0qv2ai4rrQTWtel1wAVD9Vtq4B7g6CTHA+cAm6pq\nZ1U9B2wCVrRlR1XVPVVVwC1D25IkjcGo4VDAvya5L8nqVltQVU+36WeABW16IfDU0LpbW21v9a1T\n1CVJYzLqX4J7d1VtS/JHwKYkPxleWFWVpA58935fC6bVACeeeOLBfjlJmrNGOnOoqm3teTvwLQb3\nDJ5tl4Roz9tb823ACUOrL2q1vdUXTVGfqh83VtWyqlo2MTExStclSfth2nBI8oYkf7hrGjgb+DGw\nHtg14mgVcEebXg9c0kYtLQdeaJefNgJnJzmm3Yg+G9jYlr2YZHkbpXTJ0LYkSWMwymWlBcC32ujS\n+cC/VNX3kmwGbktyGfAkcGFrvwE4D5gEfg1cClBVO5N8Btjc2n26qna26Y8AXwaOBL7bHpKkMZk2\nHKrqceDtU9R/AZw1Rb2Ay/ewrbXA2inqW4CTR+ivJGkG+AlpSVLHcJAkdQwHSVLHcJAkdQwHSVLH\ncJAkdQwHSVLHcJAkdQwHSVLHcJAkdQwHSVLHcJAkdQwHSVLHcJAkdQwHSVLHcJAkdQwHSVLHcJAk\ndQwHSVLHcJAkdQwHSVLHcJAkdQwHSVLHcJAkdQwHSVLHcJAkdQwHSVLHcJAkdQwHSVJn5HBIMi/J\n/Um+3eZPSnJvkskkX09yRKu/ts1PtuWLh7ZxZas/muScofqKVptMsubAvT1J0v7YlzOHK4BHhuav\nBa6rqrcAzwGXtfplwHOtfl1rR5KlwEXA24AVwJda4MwDvgicCywFLm5tJUljMlI4JFkEnA/c1OYD\nnAnc3pqsAy5o0yvbPG35Wa39SuDWqnqpqn4KTAKnt8dkVT1eVS8Dt7a2kqQxGfXM4fPAJ4Dftfk3\nA89X1SttfiuwsE0vBJ4CaMtfaO3/r77bOnuqd5KsTrIlyZYdO3aM2HVJ0r6aNhySvA/YXlX3zUB/\n9qqqbqyqZVW1bGJiYtzdkaRZa/4Ibd4FvD/JecDrgKOALwBHJ5nfzg4WAdta+23ACcDWJPOBNwG/\nGKrvMrzOnuqSpDGY9syhqq6sqkVVtZjBDeW7qupDwN3AB1qzVcAdbXp9m6ctv6uqqtUvaqOZTgKW\nAD8ANgNL2uinI9prrD8g706StF9GOXPYk38Ebk3yWeB+4OZWvxn4SpJJYCeDH/ZU1UNJbgMeBl4B\nLq+q3wIk+SiwEZgHrK2qh15FvyRJr9I+hUNVfR/4fpt+nMFIo93b/Ab44B7Wvxq4eor6BmDDvvRF\nknTw+AlpSVLHcJAkdQwHSVLHcJAkdQwHSVLHcJAkdQwHSVLHcJAkdQwHSVLHcJAkdQwHSVLHcJAk\ndQwHSVLHcJAkdQwHSVLHcJAkdQwHSVLHcJAkdQwHSVLHcJAkdQwHSVLHcJAkdQwHSVLHcJAkdQwH\nSVLHcJAkdQwHSVLHcJAkdQwHSVJn2nBI8rokP0jyn0keSvKpVj8pyb1JJpN8PckRrf7aNj/Zli8e\n2taVrf5oknOG6itabTLJmgP/NiVJ+2KUM4eXgDOr6u3AKcCKJMuBa4HrquotwHPAZa39ZcBzrX5d\na0eSpcBFwNuAFcCXksxLMg/4InAusBS4uLWVJI3JtOFQA79qs69pjwLOBG5v9XXABW16ZZunLT8r\nSVr91qp6qap+CkwCp7fHZFU9XlUvA7e2tpKkMRnpnkP7Df9HwHZgE/BfwPNV9UprshVY2KYXAk8B\ntOUvAG8eru+2zp7qU/VjdZItSbbs2LFjlK5LkvbDSOFQVb+tqlOARQx+03/rQe3VnvtxY1Utq6pl\nExMT4+iCJM0J+zRaqaqeB+4G3gkcnWR+W7QI2NamtwEnALTlbwJ+MVzfbZ091SVJYzLKaKWJJEe3\n6SOB9wKPMAiJD7Rmq4A72vT6Nk9bfldVVatf1EYznQQsAX4AbAaWtNFPRzC4ab3+QLw5SdL+mT99\nE44H1rVRRX8A3FZV307yMHBrks8C9wM3t/Y3A19JMgnsZPDDnqp6KMltwMPAK8DlVfVbgCQfBTYC\n84C1VfXQAXuHkqR9Nm04VNUDwKlT1B9ncP9h9/pvgA/uYVtXA1dPUd8AbBihv5KkGeAnpCVJHcNB\nktQxHCRJHcNBktQxHCRJHcNBktQxHCRJHcNBktQxHCRJHcNBktQxHCRJHcNBktQxHCRJHcNBktQx\nHCRJHcNBktQxHCRJHcNBktQxHCRJHcNBktQxHCRJHcNBktQxHCRJHcNBktQxHCRJHcNBktQxHCRJ\nHcNBktSZNhySnJDk7iQPJ3koyRWtfmySTUkea8/HtHqSXJ9kMskDSU4b2taq1v6xJKuG6u9I8mBb\n5/okORhvVpI0mlHOHF4BPl5VS4HlwOVJlgJrgDuraglwZ5sHOBdY0h6rgRtgECbAVcAZwOnAVbsC\npbX58NB6K179W5Mk7a9pw6Gqnq6qH7bpXwKPAAuBlcC61mwdcEGbXgncUgP3AEcnOR44B9hUVTur\n6jlgE7CiLTuqqu6pqgJuGdqWJGkM9umeQ5LFwKnAvcCCqnq6LXoGWNCmFwJPDa22tdX2Vt86RV2S\nNCYjh0OSNwLfAD5WVS8OL2u/8dcB7ttUfVidZEuSLTt27DjYLydJc9ZI4ZDkNQyC4atV9c1WfrZd\nEqI9b2/1bcAJQ6svarW91RdNUe9U1Y1Vtayqlk1MTIzSdUnSfhhltFKAm4FHqupzQ4vWA7tGHK0C\n7hiqX9JGLS0HXmiXnzYCZyc5pt2IPhvY2Ja9mGR5e61LhrYlSRqD+SO0eRfwN8CDSX7Uap8ErgFu\nS3IZ8CRwYVu2ATgPmAR+DVwKUFU7k3wG2NzafbqqdrbpjwBfBo4EvtsekqQxmTYcquo/gD197uCs\nKdoXcPketrUWWDtFfQtw8nR9kSTNDD8hLUnqGA6SpI7hIEnqGA6SpI7hIEnqGA6SpI7hIEnqGA6S\npI7hIEnqGA6SpI7hIEnqGA6SpI7hIEnqGA6SpI7hIEnqGA6SpI7hIEnqGA6SpI7hIEnqGA6SpI7h\nIEnqGA6SpI7hIEnqGA6SpI7hIEnqGA6SpI7hIEnqGA6SpI7hIEnqTBsOSdYm2Z7kx0O1Y5NsSvJY\nez6m1ZPk+iSTSR5IctrQOqta+8eSrBqqvyPJg22d65PkQL9JSdK+GeXM4cvAit1qa4A7q2oJcGeb\nBzgXWNIeq4EbYBAmwFXAGcDpwFW7AqW1+fDQeru/liRphk0bDlX1b8DO3corgXVteh1wwVD9lhq4\nBzg6yfHAOcCmqtpZVc8Bm4AVbdlRVXVPVRVwy9C2JEljsr/3HBZU1dNt+hlgQZteCDw11G5rq+2t\nvnWKuiRpjF71Den2G38dgL5MK8nqJFuSbNmxY8dMvKQkzUn7Gw7PtktCtOftrb4NOGGo3aJW21t9\n0RT1KVXVjVW1rKqWTUxM7GfXJUnT2d9wWA/sGnG0CrhjqH5JG7W0HHihXX7aCJyd5Jh2I/psYGNb\n9mKS5W2U0iVD25Ikjcn86Rok+RrwHuC4JFsZjDq6BrgtyWXAk8CFrfkG4DxgEvg1cClAVe1M8hlg\nc2v36aradZP7IwxGRB0JfLc9JEljNG04VNXFe1h01hRtC7h8D9tZC6ydor4FOHm6fkiSZo6fkJYk\ndQwHSVLHcJAkdQwHSVLHcJAkdQwHSVJn2qGsOnAWr/nO2F77iWvOH9trSzr8eOYgSeoYDpKkjuEg\nSeoYDpKkjuEgSeoYDpKkjuEgSeoYDpKkjuEgSeoYDpKkjuEgSeoYDpKkjuEgSeoYDpKkjuEgSeoY\nDpKkjuEgSer4l+DmiHH9FTr/Ap10ePLMQZLUMRwkSR3DQZLUMRwkSZ1D5oZ0khXAF4B5wE1Vdc2Y\nu6QDYFw3wsGb4dKrcUiEQ5J5wBeB9wJbgc1J1lfVw+PtmQ5njtCS9t8hEQ7A6cBkVT0OkORWYCVg\nOOiwYyhpNjhUwmEh8NTQ/FbgjDH1RTosjfMS3rgYiAfPoRIOI0myGljdZn+V5NERVz0O+PnB6dVh\nx30x4H4YOKz3Q649YJs6rPfDPviTURseKuGwDThhaH5Rq/2eqroRuHFfN55kS1Ut2//uzR7uiwH3\nw4D7YcD90DtUhrJuBpYkOSnJEcBFwPox90mS5qxD4syhql5J8lFgI4OhrGur6qExd0uS5qxDIhwA\nqmoDsOEgbX6fL0XNYu6LAffDgPthwP2wm1TVuPsgSTrEHCr3HCRJh5BZHw5JViR5NMlkkjXj7s9M\nSXJCkruTPJzkoSRXtPqxSTYleaw9HzPuvs6EJPOS3J/k223+pCT3tuPi620gxKyW5Ogktyf5SZJH\nkrxzDh8Pf9/+X/w4ydeSvG4uHhN7M6vDYehrOc4FlgIXJ1k63l7NmFeAj1fVUmA5cHl772uAO6tq\nCXBnm58LrgAeGZq/Friuqt4CPAdcNpZezawvAN+rqrcCb2ewP+bc8ZBkIfB3wLKqOpnBIJiLmJvH\nxB7N6nBg6Gs5quplYNfXcsx6VfV0Vf2wTf+SwQ+ChQze/7rWbB1wwXh6OHOSLALOB25q8wHOBG5v\nTWb9fkjyJuDPgZsBqurlqnqeOXg8NPOBI5PMB14PPM0cOyamM9vDYaqv5Vg4pr6MTZLFwKnAvcCC\nqnq6LXoGWDCmbs2kzwOfAH7X5t8MPF9Vr7T5uXBcnATsAP65XV67KckbmIPHQ1VtA/4J+BmDUHgB\nuI+5d0zs1WwPhzkvyRuBbwAfq6oXh5fVYKjarB6uluR9wPaqum/cfRmz+cBpwA1VdSrw3+x2CWku\nHA8A7b7KSgaB+cfAG4AVY+3UIWi2h8NIX8sxWyV5DYNg+GpVfbOVn01yfFt+PLB9XP2bIe8C3p/k\nCQaXFc9kcO396HZJAebGcbEV2FpV97b52xmExVw7HgD+EvhpVe2oqv8BvsngOJlrx8RezfZwmLNf\ny9Guq98MPFJVnxtatB5Y1aZXAXfMdN9mUlVdWVWLqmoxg3//u6rqQ8DdwAdas7mwH54BnkryZ610\nFoOvxJ9Tx0PzM2B5kte3/ye79sWcOiamM+s/BJfkPAbXnHd9LcfVY+7SjEjybuDfgQf5/2vtn2Rw\n3+E24ETgSeDCqto5lk7OsCTvAf6hqt6X5E8ZnEkcC9wP/HVVvTTO/h1sSU5hcFP+COBx4FIGvyDO\nueMhyaeAv2Iwqu9+4G8Z3GOYU8fE3sz6cJAk7bvZfllJkrQfDAdJUsdwkCR1DAdJUsdwkCR1DAdJ\nUsdwkCR1DAdJUud/AZOe7cBtylg+AAAAAElFTkSuQmCC\n",
      "text/plain": [
       "<matplotlib.figure.Figure at 0x10d06c7f0>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style>\n",
       "    .dataframe thead tr:only-child th {\n",
       "        text-align: right;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: left;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>num_category_reviewed</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>count</th>\n",
       "      <td>66639.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>mean</th>\n",
       "      <td>7.115638</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>std</th>\n",
       "      <td>8.827368</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>min</th>\n",
       "      <td>1.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10%</th>\n",
       "      <td>1.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15%</th>\n",
       "      <td>2.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20%</th>\n",
       "      <td>2.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25%</th>\n",
       "      <td>2.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>50%</th>\n",
       "      <td>4.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>60%</th>\n",
       "      <td>5.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>75%</th>\n",
       "      <td>8.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>80%</th>\n",
       "      <td>10.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>90%</th>\n",
       "      <td>16.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>95%</th>\n",
       "      <td>24.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>99%</th>\n",
       "      <td>47.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>max</th>\n",
       "      <td>93.000000</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "       num_category_reviewed\n",
       "count           66639.000000\n",
       "mean                7.115638\n",
       "std                 8.827368\n",
       "min                 1.000000\n",
       "10%                 1.000000\n",
       "15%                 2.000000\n",
       "20%                 2.000000\n",
       "25%                 2.000000\n",
       "50%                 4.000000\n",
       "60%                 5.000000\n",
       "75%                 8.000000\n",
       "80%                10.000000\n",
       "90%                16.000000\n",
       "95%                24.000000\n",
       "99%                47.000000\n",
       "max                93.000000"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "plt.hist(result_df['num_category_reviewed'])\n",
    "plt.show()     \n",
    "display(result_df.describe(percentiles=[0.1,0.15,0.2,0.25,0.5,0.6,0.75,0.8,0.9,0.95,0.99]))\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "(47535, 2)"
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "result_df[result_df.num_category_reviewed >= 3].shape"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CPU times: user 1.51 ms, sys: 1.78 ms, total: 3.29 ms\n",
      "Wall time: 128 ms\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "\n",
    "# compute intersection, union and jaccard index and store the index in the graph\n",
    "query = \"\"\"\n",
    "        MATCH ()-[s:SIMILAR_TO]->()\n",
    "        DELETE s\n",
    "        \"\"\"     \n",
    "\n",
    "with driver.session() as session:\n",
    "    result = session.run(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CPU times: user 8.38 ms, sys: 6.07 ms, total: 14.5 ms\n",
      "Wall time: 2min 30s\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "\n",
    "# compute intersection, union and jaccard index and store the index in the graph\n",
    "# only do for user pairs who have reviewed at least 5 businesses in a category\n",
    "query = \"\"\"\n",
    "        MATCH (u1:User)-[r1:REVIEWED_CATEGORY]->(c:Category)<-[r2:REVIEWED_CATEGORY]-(u2:User)\n",
    "        WHERE r1.num_reviewed >= 5\n",
    "          AND r2.num_reviewed >= 5\n",
    "          AND id(u1) < id(u2) \n",
    "        WITH  u1, u2, COUNT(DISTINCT c) as intersection_count, \n",
    "                SIZE((u1)-[:REVIEWED_CATEGORY]->()) as cat1,\n",
    "                SIZE((u2)-[:REVIEWED_CATEGORY]->()) as cat2\n",
    "        WITH  u1, u2, (intersection_count * 1.0) / (cat1 + cat2 - intersection_count) as jaccard_index\n",
    "        CREATE (u1)-[:SIMILAR_TO {similarity: jaccard_index}]->(u2)\n",
    "        \"\"\"     \n",
    "\n",
    "with driver.session() as session:\n",
    "    result = session.run(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style>\n",
       "    .dataframe thead tr:only-child th {\n",
       "        text-align: right;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: left;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>COUNT(DISTINCT u)</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>3283</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   COUNT(DISTINCT u)\n",
       "0               3283"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CPU times: user 9.6 ms, sys: 3.25 ms, total: 12.9 ms\n",
      "Wall time: 1.21 s\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "\n",
    "query = \"\"\"\n",
    "        MATCH (u:User)-[r:SIMILAR_TO]->()\n",
    "        RETURN COUNT(DISTINCT u)       \n",
    "        \"\"\"     \n",
    "\n",
    "with driver.session() as session:\n",
    "    result = session.run(query)\n",
    "    \n",
    "result_df = pd.DataFrame([dict(record) for record in result])\n",
    "    \n",
    "display(result_df.head())"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CPU times: user 1.84 ms, sys: 1.99 ms, total: 3.83 ms\n",
      "Wall time: 579 ms\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "\n",
    "query = \"\"\"\n",
    "        MATCH ()-[r:SIMILAR_TO]->()\n",
    "        RETURN COUNT(r)       \n",
    "        \"\"\"     \n",
    "\n",
    "with driver.session() as session:\n",
    "    result = session.run(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style>\n",
       "    .dataframe thead tr:only-child th {\n",
       "        text-align: right;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: left;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>COUNT(r)</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>3157255</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   COUNT(r)\n",
       "0   3157255"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "similarto_df = pd.DataFrame([dict(record) for record in result])\n",
    "    \n",
    "display(similarto_df.head())"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Part 2: Label Propagation"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "# users we're considering for label prop"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style>\n",
       "    .dataframe thead tr:only-child th {\n",
       "        text-align: right;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: left;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>COUNT(distinct u)</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>3288</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   COUNT(distinct u)\n",
       "0               3288"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "  MATCH (u:User)-[r:REVIEWED_CATEGORY]->() WHERE r.num_reviewed >= 5 RETURN COUNT(distinct u)\n",
    "  \"\"\"\n",
    "\n",
    "with driver.session() as session:\n",
    "    result = session.run(query)\n",
    "    \n",
    "result_df = pd.DataFrame([dict(record) for record in result])\n",
    "    \n",
    "display(result_df.head())"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CPU times: user 2.3 ms, sys: 2.62 ms, total: 4.91 ms\n",
      "Wall time: 6.04 s\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "\n",
    "  # call label prop using jaccard index as weight \n",
    "query = \"\"\"\n",
    "CALL algo.labelPropagation(\n",
    "  \"MATCH (u:User)-[s:SIMILAR_TO]->() RETURN DISTINCT id(u) as id\",\n",
    "  \"MATCH (u1:User)-[s:SIMILAR_TO]->(u2:User) RETURN id(u1) as source, id(u2) as target, s.similarity as weight\",\n",
    "  \"OUT\",\n",
    "  {graph:'cypher', iterations:100, partitionProperty:'cluster', weightProperty:'similarity', write: true})\n",
    "  YIELD nodes, iterations, didConverge, loadMillis, computeMillis, writeMillis, write, partitionProperty;\n",
    "  \"\"\"\n",
    "\n",
    "with driver.session() as session:\n",
    "    result = session.run(query)\n",
    "    "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style>\n",
       "    .dataframe thead tr:only-child th {\n",
       "        text-align: right;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: left;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>computeMillis</th>\n",
       "      <th>didConverge</th>\n",
       "      <th>iterations</th>\n",
       "      <th>loadMillis</th>\n",
       "      <th>nodes</th>\n",
       "      <th>partitionProperty</th>\n",
       "      <th>write</th>\n",
       "      <th>writeMillis</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1412</td>\n",
       "      <td>True</td>\n",
       "      <td>6</td>\n",
       "      <td>4458</td>\n",
       "      <td>3283</td>\n",
       "      <td>cluster</td>\n",
       "      <td>True</td>\n",
       "      <td>7</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   computeMillis  didConverge  iterations  loadMillis  nodes  \\\n",
       "0           1412         True           6        4458   3283   \n",
       "\n",
       "  partitionProperty  write  writeMillis  \n",
       "0           cluster   True            7  "
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "result_df = pd.DataFrame([dict(record) for record in result])\n",
    "    \n",
    "display(result_df.head(10))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CPU times: user 3.29 s, sys: 165 ms, total: 3.46 s\n",
      "Wall time: 3.88 s\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "\n",
    "query = \"\"\"\n",
    "        MATCH (u:User)\n",
    "        RETURN u.id, u.cluster\n",
    "        \"\"\"     \n",
    "\n",
    "with driver.session() as session:\n",
    "    result = session.run(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style>\n",
       "    .dataframe thead tr:only-child th {\n",
       "        text-align: right;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: left;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>u.cluster</th>\n",
       "      <th>u.id</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>2899999</td>\n",
       "      <td>EDH3SBuXcs8_pTrjSVJDnQ</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>1</td>\n",
       "      <td>FQayGWArjAfBgcvmm07dgw</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>2</td>\n",
       "      <td>9YOzCI_usUjGOCjn2khK4A</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>3</td>\n",
       "      <td>rRxREkOeMghC9OvSj-4KZg</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>4</td>\n",
       "      <td>ZKBJvRqfDGetdTLG4CdlzA</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>5</td>\n",
       "      <td>7VoHyLO1O0BbKb2wHD8bfA</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>6</td>\n",
       "      <td>BoVXPUjo0yc8DCwTpZ0qwQ</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>7</td>\n",
       "      <td>NOYCoDc5-hQiWrLpYC_9gw</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>8</td>\n",
       "      <td>op2yH1xpItKK4VqigfnuOA</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>9</td>\n",
       "      <td>KxRgu76i_tWQKFZB1cIjww</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   u.cluster                    u.id\n",
       "0    2899999  EDH3SBuXcs8_pTrjSVJDnQ\n",
       "1          1  FQayGWArjAfBgcvmm07dgw\n",
       "2          2  9YOzCI_usUjGOCjn2khK4A\n",
       "3          3  rRxREkOeMghC9OvSj-4KZg\n",
       "4          4  ZKBJvRqfDGetdTLG4CdlzA\n",
       "5          5  7VoHyLO1O0BbKb2wHD8bfA\n",
       "6          6  BoVXPUjo0yc8DCwTpZ0qwQ\n",
       "7          7  NOYCoDc5-hQiWrLpYC_9gw\n",
       "8          8  op2yH1xpItKK4VqigfnuOA\n",
       "9          9  KxRgu76i_tWQKFZB1cIjww"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "result_df = pd.DataFrame([dict(record) for record in result])\n",
    "    \n",
    "display(result_df.head(10))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "x = pd.DataFrame(result_df.groupby('u.cluster')['u.id'].count()).reset_index()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style>\n",
       "    .dataframe thead tr:only-child th {\n",
       "        text-align: right;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: left;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>u.cluster</th>\n",
       "      <th>u.id</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>2</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>3</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>4</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>5</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   u.cluster  u.id\n",
       "0          1     1\n",
       "1          2     1\n",
       "2          3     1\n",
       "3          4     1\n",
       "4          5     1"
      ]
     },
     "execution_count": 21,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "x.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style>\n",
       "    .dataframe thead tr:only-child th {\n",
       "        text-align: right;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: left;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>u.cluster</th>\n",
       "      <th>u.id</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>411</th>\n",
       "      <td>433</td>\n",
       "      <td>3283</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "     u.cluster  u.id\n",
       "411        433  3283"
      ]
     },
     "execution_count": 22,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "x[x['u.id'] > 1] "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "66639"
      ]
     },
     "execution_count": 12,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "x['u.id'].sum()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.6.1"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
