{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Data Science with Neo4j Using Yelp Data"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Module 2: Segmentation and Community Detection (Work in Progress)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Goal: Find communities based on categories of restaurants users review      \n",
    "\n",
    "Algorithm: Label Propagation\n",
    "\n",
    "High Level Approach:\n",
    "      \n",
    "- Subset data to only include restaurants in Toronto.  Consequently, this means we are only considering users who reviewed restaurants in Toronto.\n",
    "- Remove initial dependency on category taxonomy (re: Jesus' post)\n",
    "- Create weights between users to form tighter communities (jaccard index between users based on # restaurant categories)\n",
    "- Draw parallels with traditional data science clustering approaches (eg: k-means, kNN)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "from neo4j.v1 import GraphDatabase, basic_auth\n",
    "import pandas as pd\n",
    "import matplotlib.pyplot as plt"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "driver = GraphDatabase.driver(\"bolt://localhost:7687\", auth=basic_auth(\"neo4j\", \"neo4jneo4j\"))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style>\n",
       "    .dataframe thead tr:only-child th {\n",
       "        text-align: right;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: left;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>business_count</th>\n",
       "      <th>c.name</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>1478</td>\n",
       "      <td>Food</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>940</td>\n",
       "      <td>Nightlife</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>907</td>\n",
       "      <td>Bars</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>629</td>\n",
       "      <td>Canadian (New)</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>37</th>\n",
       "      <td>619</td>\n",
       "      <td>Sandwiches</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>606</td>\n",
       "      <td>Breakfast &amp; Brunch</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>559</td>\n",
       "      <td>Chinese</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>39</th>\n",
       "      <td>551</td>\n",
       "      <td>Cafes</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25</th>\n",
       "      <td>509</td>\n",
       "      <td>Pizza</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>496</td>\n",
       "      <td>Coffee &amp; Tea</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>490</td>\n",
       "      <td>Japanese</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>424</td>\n",
       "      <td>Fast Food</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22</th>\n",
       "      <td>417</td>\n",
       "      <td>Burgers</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>341</td>\n",
       "      <td>Sushi Bars</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>45</th>\n",
       "      <td>325</td>\n",
       "      <td>American (Traditional)</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>291</td>\n",
       "      <td>Indian</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>275</td>\n",
       "      <td>Thai</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>54</th>\n",
       "      <td>275</td>\n",
       "      <td>Middle Eastern</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>266</td>\n",
       "      <td>Mediterranean</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>265</td>\n",
       "      <td>Asian Fusion</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>243</td>\n",
       "      <td>Mexican</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>32</th>\n",
       "      <td>239</td>\n",
       "      <td>Korean</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>36</th>\n",
       "      <td>227</td>\n",
       "      <td>Seafood</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>95</th>\n",
       "      <td>224</td>\n",
       "      <td>Pubs</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>220</td>\n",
       "      <td>Specialty Food</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>71</th>\n",
       "      <td>207</td>\n",
       "      <td>Event Planning &amp; Services</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>38</th>\n",
       "      <td>204</td>\n",
       "      <td>Bakeries</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>26</th>\n",
       "      <td>191</td>\n",
       "      <td>Chicken Wings</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>110</th>\n",
       "      <td>191</td>\n",
       "      <td>Desserts</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>24</th>\n",
       "      <td>185</td>\n",
       "      <td>Vietnamese</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>233</th>\n",
       "      <td>1</td>\n",
       "      <td>Cooking Schools</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>208</th>\n",
       "      <td>1</td>\n",
       "      <td>Pet Sitting</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>231</th>\n",
       "      <td>1</td>\n",
       "      <td>Shopping Centers</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>211</th>\n",
       "      <td>1</td>\n",
       "      <td>Tax Services</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>213</th>\n",
       "      <td>1</td>\n",
       "      <td>Accountants</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>215</th>\n",
       "      <td>1</td>\n",
       "      <td>Laundromat</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>248</th>\n",
       "      <td>1</td>\n",
       "      <td>Themed Cafes</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>185</th>\n",
       "      <td>1</td>\n",
       "      <td>Head Shops</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>273</th>\n",
       "      <td>1</td>\n",
       "      <td>Home Decor</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>252</th>\n",
       "      <td>1</td>\n",
       "      <td>Vitamins &amp; Supplements</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>272</th>\n",
       "      <td>1</td>\n",
       "      <td>Comic Books</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>216</th>\n",
       "      <td>1</td>\n",
       "      <td>Laundry Services</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>270</th>\n",
       "      <td>1</td>\n",
       "      <td>Nutritionists</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>269</th>\n",
       "      <td>1</td>\n",
       "      <td>Video Game Stores</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>156</th>\n",
       "      <td>1</td>\n",
       "      <td>Accessories</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>267</th>\n",
       "      <td>1</td>\n",
       "      <td>Macarons</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>266</th>\n",
       "      <td>1</td>\n",
       "      <td>Discount Store</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>1</td>\n",
       "      <td>Tiki Bars</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>264</th>\n",
       "      <td>1</td>\n",
       "      <td>Cannabis Clinics</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>262</th>\n",
       "      <td>1</td>\n",
       "      <td>Videos &amp; Video Game Rental</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>261</th>\n",
       "      <td>1</td>\n",
       "      <td>Speakeasies</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>260</th>\n",
       "      <td>1</td>\n",
       "      <td>Gas Stations</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>259</th>\n",
       "      <td>1</td>\n",
       "      <td>Automotive</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>165</th>\n",
       "      <td>1</td>\n",
       "      <td>Wineries</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>176</th>\n",
       "      <td>1</td>\n",
       "      <td>Piano Bars</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>184</th>\n",
       "      <td>1</td>\n",
       "      <td>Custom Cakes</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>255</th>\n",
       "      <td>1</td>\n",
       "      <td>IT Services &amp; Computer Repair</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>254</th>\n",
       "      <td>1</td>\n",
       "      <td>Mobile Phone Repair</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>253</th>\n",
       "      <td>1</td>\n",
       "      <td>Churches</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>320</th>\n",
       "      <td>1</td>\n",
       "      <td>Minho</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>321 rows × 2 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "     business_count                         c.name\n",
       "7              1478                           Food\n",
       "2               940                      Nightlife\n",
       "4               907                           Bars\n",
       "16              629                 Canadian (New)\n",
       "37              619                     Sandwiches\n",
       "5               606             Breakfast & Brunch\n",
       "14              559                        Chinese\n",
       "39              551                          Cafes\n",
       "25              509                          Pizza\n",
       "6               496                   Coffee & Tea\n",
       "20              490                       Japanese\n",
       "18              424                      Fast Food\n",
       "22              417                        Burgers\n",
       "19              341                     Sushi Bars\n",
       "45              325         American (Traditional)\n",
       "17              291                         Indian\n",
       "12              275                           Thai\n",
       "54              275                 Middle Eastern\n",
       "8               266                  Mediterranean\n",
       "21              265                   Asian Fusion\n",
       "3               243                        Mexican\n",
       "32              239                         Korean\n",
       "36              227                        Seafood\n",
       "95              224                           Pubs\n",
       "11              220                 Specialty Food\n",
       "71              207      Event Planning & Services\n",
       "38              204                       Bakeries\n",
       "26              191                  Chicken Wings\n",
       "110             191                       Desserts\n",
       "24              185                     Vietnamese\n",
       "..              ...                            ...\n",
       "233               1                Cooking Schools\n",
       "208               1                    Pet Sitting\n",
       "231               1               Shopping Centers\n",
       "211               1                   Tax Services\n",
       "213               1                    Accountants\n",
       "215               1                     Laundromat\n",
       "248               1                   Themed Cafes\n",
       "185               1                     Head Shops\n",
       "273               1                     Home Decor\n",
       "252               1         Vitamins & Supplements\n",
       "272               1                    Comic Books\n",
       "216               1               Laundry Services\n",
       "270               1                  Nutritionists\n",
       "269               1              Video Game Stores\n",
       "156               1                    Accessories\n",
       "267               1                       Macarons\n",
       "266               1                 Discount Store\n",
       "1                 1                      Tiki Bars\n",
       "264               1               Cannabis Clinics\n",
       "262               1     Videos & Video Game Rental\n",
       "261               1                    Speakeasies\n",
       "260               1                   Gas Stations\n",
       "259               1                     Automotive\n",
       "165               1                       Wineries\n",
       "176               1                     Piano Bars\n",
       "184               1                   Custom Cakes\n",
       "255               1  IT Services & Computer Repair\n",
       "254               1            Mobile Phone Repair\n",
       "253               1                       Churches\n",
       "320               1                          Minho\n",
       "\n",
       "[321 rows x 2 columns]"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CPU times: user 40.9 ms, sys: 3.07 ms, total: 44 ms\n",
      "Wall time: 53.1 ms\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "# get count of businesses in each category. this will be used to determine which categories to include in our analysis\n",
    "query = \"\"\"\n",
    "        MATCH (c:Category)\n",
    "        RETURN c.name, size(()-[:IN_CATEGORY]->(c)) AS business_count   \n",
    "        ORDER BY c, business_count DESC\n",
    "        \"\"\"\n",
    "\n",
    "with driver.session() as session:\n",
    "    result = session.run(query)\n",
    "\n",
    "for row in result:\n",
    "    result_df = pd.DataFrame([dict(record) for record in result])\n",
    "    \n",
    "display(result_df.sort_values('business_count',ascending=False))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "# more clean-up required once category taxonomy removed"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "image/png": "iVBORw0KGgoAAAANSUhEUgAAAXoAAAD8CAYAAAB5Pm/hAAAABHNCSVQICAgIfAhkiAAAAAlwSFlz\nAAALEgAACxIB0t1+/AAAD/9JREFUeJzt3X+s3XV9x/Hna1Rx/oiU9drVtu5W0y3BPyykYRjNwsYG\niMZqYkiJ0epYajZMdDMxRZPp/iDBzR/TZENRmLggyBRHg2wOOxLjH6KFIRSwUqWMNoVW3dDNxAi+\n98f5FA5d6f1x7rnn3o/PR3Jyvt/P9/M93/f9tN/XPedzvufcVBWSpH792qQLkCSNl0EvSZ0z6CWp\ncwa9JHXOoJekzhn0ktQ5g16SOmfQS1LnDHpJ6tyKSRcAsGrVqpqenp50GZK0rNxxxx0/rKqpmfot\niaCfnp5m9+7dky5DkpaVJA/Npp9TN5LUOYNekjpn0EtS5wx6SeqcQS9JnTPoJalzBr0kdc6gl6TO\nGfSS1Lkl8cnYUUzv+MrEjr3/8tdO7NiSNFs+o5ekzhn0ktQ5g16SOmfQS1LnDHpJ6pxBL0mdM+gl\nqXMGvSR1zqCXpM4Z9JLUOYNekjpn0EtS5wx6SeqcQS9JnTPoJalzBr0kdc6gl6TOzRj0SdYnuS3J\nfUnuTfKu1v7BJAeT3NVuFwztc2mSfUn2JjlvnD+AJOnEZvOnBB8H3lNVdyZ5AXBHklvbto9V1YeH\nOyc5DdgKvBx4MfC1JL9dVU8sZOGSpNmZ8Rl9VR2qqjvb8k+B+4G1J9hlC3B9Vf28qh4E9gFnLkSx\nkqS5m9McfZJp4HTg9tb0ziR3J7k6ycrWthZ4eGi3A5z4F4MkaYxmHfRJng98CXh3Vf0EuAJ4GbAJ\nOAR8ZC4HTrI9ye4ku48cOTKXXSVJczCroE/yLAYhf21V3QhQVY9W1RNV9Uvg0zw1PXMQWD+0+7rW\n9jRVdWVVba6qzVNTU6P8DJKkE5jNVTcBrgLur6qPDrWvGer2RmBPW94JbE1ycpINwEbgWwtXsiRp\nLmZz1c2rgLcA9yS5q7W9D7goySaggP3AOwCq6t4kNwD3Mbhi5xKvuJGkyZkx6KvqG0COs+mWE+xz\nGXDZCHVJkhaIn4yVpM4Z9JLUOYNekjpn0EtS5wx6SeqcQS9JnTPoJalzBr0kdc6gl6TOGfSS1DmD\nXpI6Z9BLUucMeknqnEEvSZ0z6CWpcwa9JHXOoJekzhn0ktQ5g16SOmfQS1LnDHpJ6pxBL0mdM+gl\nqXMGvSR1zqCXpM4Z9JLUOYNekjpn0EtS52YM+iTrk9yW5L4k9yZ5V2s/NcmtSR5o9ytbe5J8Ism+\nJHcnOWPcP4Qk6ZnN5hn948B7quo04CzgkiSnATuAXVW1EdjV1gFeA2xst+3AFQtetSRp1mYM+qo6\nVFV3tuWfAvcDa4EtwDWt2zXAG9ryFuBzNfBN4JQkaxa8cknSrMxpjj7JNHA6cDuwuqoOtU2PAKvb\n8lrg4aHdDrQ2SdIEzDrokzwf+BLw7qr6yfC2qiqg5nLgJNuT7E6y+8iRI3PZVZI0B7MK+iTPYhDy\n11bVja350aNTMu3+cGs/CKwf2n1da3uaqrqyqjZX1eapqan51i9JmsFsrroJcBVwf1V9dGjTTmBb\nW94G3DTU/tZ29c1ZwGNDUzySpEW2YhZ9XgW8BbgnyV2t7X3A5cANSS4GHgIubNtuAS4A9gE/A96+\noBVLkuZkxqCvqm8AeYbN5xynfwGXjFiXJGmB+MlYSeqcQS9JnTPoJalzBr0kdc6gl6TOGfSS1DmD\nXpI6Z9BLUucMeknqnEEvSZ0z6CWpcwa9JHXOoJekzhn0ktQ5g16SOmfQS1LnDHpJ6pxBL0mdM+gl\nqXMGvSR1zqCXpM4Z9JLUOYNekjpn0EtS5wx6SeqcQS9JnTPoJalzBr0kdW7GoE9ydZLDSfYMtX0w\nycEkd7XbBUPbLk2yL8neJOeNq3BJ0uzM5hn9Z4Hzj9P+sara1G63ACQ5DdgKvLzt8/dJTlqoYiVJ\nczdj0FfV14Efz/LxtgDXV9XPq+pBYB9w5gj1SZJGNMoc/TuT3N2mdla2trXAw0N9DrQ2SdKEzDfo\nrwBeBmwCDgEfmesDJNmeZHeS3UeOHJlnGZKkmcwr6Kvq0ap6oqp+CXyap6ZnDgLrh7qua23He4wr\nq2pzVW2empqaTxmSpFmYV9AnWTO0+kbg6BU5O4GtSU5OsgHYCHxrtBIlSaNYMVOHJNcBZwOrkhwA\nPgCcnWQTUMB+4B0AVXVvkhuA+4DHgUuq6onxlC5Jmo0Zg76qLjpO81Un6H8ZcNkoRUmSFo6fjJWk\nzhn0ktQ5g16SOmfQS1LnDHpJ6pxBL0mdM+glqXMGvSR1zqCXpM4Z9JLUOYNekjpn0EtS5wx6Seqc\nQS9JnTPoJalzBr0kdc6gl6TOGfSS1DmDXpI6Z9BLUucMeknqnEEvSZ0z6CWpcwa9JHXOoJekzhn0\nktQ5g16SOmfQS1LnZgz6JFcnOZxkz1DbqUluTfJAu1/Z2pPkE0n2Jbk7yRnjLF6SNLPZPKP/LHD+\nMW07gF1VtRHY1dYBXgNsbLftwBULU6Ykab5mDPqq+jrw42OatwDXtOVrgDcMtX+uBr4JnJJkzUIV\nK0mau/nO0a+uqkNt+RFgdVteCzw81O9Aa5MkTcjIb8ZWVQE11/2SbE+yO8nuI0eOjFqGJOkZzDfo\nHz06JdPuD7f2g8D6oX7rWtv/U1VXVtXmqto8NTU1zzIkSTOZb9DvBLa15W3ATUPtb21X35wFPDY0\nxSNJmoAVM3VIch1wNrAqyQHgA8DlwA1JLgYeAi5s3W8BLgD2AT8D3j6GmiVJczBj0FfVRc+w6Zzj\n9C3gklGLkiQtHD8ZK0mdM+glqXMGvSR1zqCXpM4Z9JLUOYNekjpn0EtS5wx6SeqcQS9JnTPoJalz\nBr0kdc6gl6TOGfSS1DmDXpI6Z9BLUucMeknqnEEvSZ0z6CWpcwa9JHXOoJekzhn0ktQ5g16SOmfQ\nS1LnDHpJ6pxBL0mdM+glqXMGvSR1zqCXpM6tGGXnJPuBnwJPAI9X1eYkpwJfAKaB/cCFVfVfo5Up\nSZqvhXhG//tVtamqNrf1HcCuqtoI7GrrkqQJGcfUzRbgmrZ8DfCGMRxDkjRLowZ9Af+W5I4k21vb\n6qo61JYfAVaPeAxJ0ghGmqMHXl1VB5O8CLg1yXeHN1ZVJanj7dh+MWwHeMlLXjJiGZKkZzLSM/qq\nOtjuDwNfBs4EHk2yBqDdH36Gfa+sqs1VtXlqamqUMiRJJzDvoE/yvCQvOLoMnAvsAXYC21q3bcBN\noxYpSZq/UaZuVgNfTnL0cT5fVf+a5NvADUkuBh4CLhy9TEnSfM076KvqB8ArjtP+I+CcUYqSJC0c\nPxkrSZ0z6CWpcwa9JHXOoJekzhn0ktQ5g16SOmfQS1LnDHpJ6pxBL0mdM+glqXMGvSR1zqCXpM4Z\n9JLUuVH/wtSvtOkdX5nIcfdf/tqJHFfS8uQzeknqnEEvSZ0z6CWpcwa9JHXOoJekzhn0ktQ5g16S\nOmfQS1LnDHpJ6pxBL0mdM+glqXMGvSR1zqCXpM4Z9JLUubF9TXGS84GPAycBn6mqy8d1LC0ev5pZ\nWn7GEvRJTgL+Dvgj4ADw7SQ7q+q+cRzvV82kwlbS8jSuZ/RnAvuq6gcASa4HtgAGveZlkr/cJvVq\nwldPWijjCvq1wMND6weA3x3TsSRpJL0/kZjYnxJMsh3Y3lb/J8neeT7UKuCHC1PV2CyHGmF51Lno\nNeZDc95lWY/jPH7ecVkO4wgj1jnieP/WbDqNK+gPAuuH1te1tidV1ZXAlaMeKMnuqto86uOM03Ko\nEZZHnda4MKxx4SyHOsd1eeW3gY1JNiR5NrAV2DmmY0mSTmAsz+ir6vEk7wS+yuDyyqur6t5xHEuS\ndGJjm6OvqluAW8b1+ENGnv5ZBMuhRlgedVrjwrDGhbPk60xVTboGSdIY+RUIktS5ZR30Sc5PsjfJ\nviQ7JljH+iS3Jbkvyb1J3tXaT01ya5IH2v3K1p4kn2h1353kjEWs9aQk/5Hk5ra+IcntrZYvtDfP\nSXJyW9/Xtk8vUn2nJPliku8muT/JK5faOCb58/bvvCfJdUmesxTGMcnVSQ4n2TPUNuexS7Kt9X8g\nybZFqPFv2r/33Um+nOSUoW2Xthr3JjlvqH1s5/7xahza9p4klWRVW5/IOM5ZVS3LG4M3eb8PvBR4\nNvAd4LQJ1bIGOKMtvwD4HnAa8NfAjta+A/hQW74A+BcgwFnA7YtY618Anwdubus3AFvb8ieBP23L\nfwZ8si1vBb6wSPVdA/xJW342cMpSGkcGHwZ8EPj1ofF721IYR+D3gDOAPUNtcxo74FTgB+1+ZVte\nOeYazwVWtOUPDdV4WjuvTwY2tPP9pHGf+8ersbWvZ3CByUPAqkmO45x/pkkdeAH+MV4JfHVo/VLg\n0knX1Wq5icH3/OwF1rS2NcDetvwp4KKh/k/2G3Nd64BdwB8AN7f/nD8cOsmeHNP2H/qVbXlF65cx\n1/fCFqI5pn3JjCNPfer71DYuNwPnLZVxBKaPCdE5jR1wEfCpofan9RtHjcdseyNwbVt+2jl9dCwX\n49w/Xo3AF4FXAPt5KugnNo5zuS3nqZvjfc3C2gnV8qT20vx04HZgdVUdapseAVa35UnV/rfAe4Ff\ntvXfAP67qh4/Th1P1ti2P9b6j9MG4AjwD2166TNJnscSGseqOgh8GPhP4BCDcbmDpTWOw+Y6dpM+\nr/6YwTNkTlDLoteYZAtwsKq+c8ymJVPjiSznoF9ykjwf+BLw7qr6yfC2Gvxan9glTkleBxyuqjsm\nVcMsrGDwkvmKqjod+F8G0w1PWgLjuJLBF/RtAF4MPA84f1L1zMWkx24mSd4PPA5cO+lahiV5LvA+\n4C8nXct8Leegn/FrFhZTkmcxCPlrq+rG1vxokjVt+xrgcGufRO2vAl6fZD9wPYPpm48DpyQ5+nmK\n4TqerLFtfyHwozHXeAA4UFW3t/UvMgj+pTSOfwg8WFVHquoXwI0MxnYpjeOwuY7dRM6rJG8DXge8\nuf1CWko1vozBL/bvtPNnHXBnkt9cQjWe0HIO+iXzNQtJAlwF3F9VHx3atBM4+m77NgZz90fb39re\nsT8LeGzo5fVYVNWlVbWuqqYZjNW/V9WbgduANz1DjUdrf1PrP9Zng1X1CPBwkt9pTecw+GrrJTOO\nDKZszkry3PbvfrTGJTOOx5jr2H0VODfJyvbq5dzWNjYZ/JGi9wKvr6qfHVP71nbl0gZgI/AtFvnc\nr6p7qupFVTXdzp8DDC6+eIQlNI4nNKk3BxbixuAd7+8xeAf+/ROs49UMXhLfDdzVbhcwmIvdBTwA\nfA04tfUPgz/M8n3gHmDzItd7Nk9ddfNSBifPPuCfgJNb+3Pa+r62/aWLVNsmYHcby39mcMXCkhpH\n4K+A7wJ7gH9kcFXIxMcRuI7B+wa/YBBGF89n7BjMk+9rt7cvQo37GMxnHz13PjnU//2txr3Aa4ba\nx3buH6/GY7bv56k3YycyjnO9+clYSerccp66kSTNgkEvSZ0z6CWpcwa9JHXOoJekzhn0ktQ5g16S\nOmfQS1Ln/g935f1bR95OdQAAAABJRU5ErkJggg==\n",
      "text/plain": [
       "<matplotlib.figure.Figure at 0x10ec8e518>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style>\n",
       "    .dataframe thead tr:only-child th {\n",
       "        text-align: right;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: left;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>business_count</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>count</th>\n",
       "      <td>321.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>mean</th>\n",
       "      <td>59.551402</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>std</th>\n",
       "      <td>150.383046</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>min</th>\n",
       "      <td>1.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25%</th>\n",
       "      <td>1.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>50%</th>\n",
       "      <td>6.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>75%</th>\n",
       "      <td>37.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>max</th>\n",
       "      <td>1478.000000</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "       business_count\n",
       "count      321.000000\n",
       "mean        59.551402\n",
       "std        150.383046\n",
       "min          1.000000\n",
       "25%          1.000000\n",
       "50%          6.000000\n",
       "75%         37.000000\n",
       "max       1478.000000"
      ]
     },
     "execution_count": 11,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "plt.hist(result_df['business_count'])\n",
    "plt.show()  \n",
    "\n",
    "result_df.describe()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style>\n",
       "    .dataframe thead tr:only-child th {\n",
       "        text-align: right;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: left;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>business_count</th>\n",
       "      <th>c.name</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>1478</td>\n",
       "      <td>Food</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>940</td>\n",
       "      <td>Nightlife</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>907</td>\n",
       "      <td>Bars</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>629</td>\n",
       "      <td>Canadian (New)</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>37</th>\n",
       "      <td>619</td>\n",
       "      <td>Sandwiches</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>606</td>\n",
       "      <td>Breakfast &amp; Brunch</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>559</td>\n",
       "      <td>Chinese</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>39</th>\n",
       "      <td>551</td>\n",
       "      <td>Cafes</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25</th>\n",
       "      <td>509</td>\n",
       "      <td>Pizza</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>496</td>\n",
       "      <td>Coffee &amp; Tea</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>490</td>\n",
       "      <td>Japanese</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>424</td>\n",
       "      <td>Fast Food</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22</th>\n",
       "      <td>417</td>\n",
       "      <td>Burgers</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>341</td>\n",
       "      <td>Sushi Bars</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>45</th>\n",
       "      <td>325</td>\n",
       "      <td>American (Traditional)</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>291</td>\n",
       "      <td>Indian</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>54</th>\n",
       "      <td>275</td>\n",
       "      <td>Middle Eastern</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>275</td>\n",
       "      <td>Thai</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>266</td>\n",
       "      <td>Mediterranean</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>265</td>\n",
       "      <td>Asian Fusion</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>243</td>\n",
       "      <td>Mexican</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>32</th>\n",
       "      <td>239</td>\n",
       "      <td>Korean</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>36</th>\n",
       "      <td>227</td>\n",
       "      <td>Seafood</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>95</th>\n",
       "      <td>224</td>\n",
       "      <td>Pubs</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>220</td>\n",
       "      <td>Specialty Food</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>71</th>\n",
       "      <td>207</td>\n",
       "      <td>Event Planning &amp; Services</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>38</th>\n",
       "      <td>204</td>\n",
       "      <td>Bakeries</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>26</th>\n",
       "      <td>191</td>\n",
       "      <td>Chicken Wings</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>110</th>\n",
       "      <td>191</td>\n",
       "      <td>Desserts</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>24</th>\n",
       "      <td>185</td>\n",
       "      <td>Vietnamese</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>27</th>\n",
       "      <td>182</td>\n",
       "      <td>Salad</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>53</th>\n",
       "      <td>182</td>\n",
       "      <td>Barbeque</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>63</th>\n",
       "      <td>171</td>\n",
       "      <td>Diners</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>170</td>\n",
       "      <td>French</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>28</th>\n",
       "      <td>170</td>\n",
       "      <td>Vegetarian</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>65</th>\n",
       "      <td>165</td>\n",
       "      <td>American (New)</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>82</th>\n",
       "      <td>159</td>\n",
       "      <td>Comfort Food</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>43</th>\n",
       "      <td>153</td>\n",
       "      <td>Caribbean</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>72</th>\n",
       "      <td>153</td>\n",
       "      <td>Greek</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>70</th>\n",
       "      <td>152</td>\n",
       "      <td>Caterers</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>58</th>\n",
       "      <td>150</td>\n",
       "      <td>Vegan</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>48</th>\n",
       "      <td>127</td>\n",
       "      <td>Lounges</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>46</th>\n",
       "      <td>122</td>\n",
       "      <td>Cocktail Bars</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>29</th>\n",
       "      <td>117</td>\n",
       "      <td>Gluten-Free</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>122</th>\n",
       "      <td>115</td>\n",
       "      <td>Halal</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>52</th>\n",
       "      <td>114</td>\n",
       "      <td>Delis</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>94</th>\n",
       "      <td>112</td>\n",
       "      <td>Wine Bars</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>84</th>\n",
       "      <td>108</td>\n",
       "      <td>Sports Bars</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>61</th>\n",
       "      <td>105</td>\n",
       "      <td>Juice Bars &amp; Smoothies</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>76</th>\n",
       "      <td>105</td>\n",
       "      <td>Gastropubs</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "     business_count                     c.name\n",
       "7              1478                       Food\n",
       "2               940                  Nightlife\n",
       "4               907                       Bars\n",
       "16              629             Canadian (New)\n",
       "37              619                 Sandwiches\n",
       "5               606         Breakfast & Brunch\n",
       "14              559                    Chinese\n",
       "39              551                      Cafes\n",
       "25              509                      Pizza\n",
       "6               496               Coffee & Tea\n",
       "20              490                   Japanese\n",
       "18              424                  Fast Food\n",
       "22              417                    Burgers\n",
       "19              341                 Sushi Bars\n",
       "45              325     American (Traditional)\n",
       "17              291                     Indian\n",
       "54              275             Middle Eastern\n",
       "12              275                       Thai\n",
       "8               266              Mediterranean\n",
       "21              265               Asian Fusion\n",
       "3               243                    Mexican\n",
       "32              239                     Korean\n",
       "36              227                    Seafood\n",
       "95              224                       Pubs\n",
       "11              220             Specialty Food\n",
       "71              207  Event Planning & Services\n",
       "38              204                   Bakeries\n",
       "26              191              Chicken Wings\n",
       "110             191                   Desserts\n",
       "24              185                 Vietnamese\n",
       "27              182                      Salad\n",
       "53              182                   Barbeque\n",
       "63              171                     Diners\n",
       "0               170                     French\n",
       "28              170                 Vegetarian\n",
       "65              165             American (New)\n",
       "82              159               Comfort Food\n",
       "43              153                  Caribbean\n",
       "72              153                      Greek\n",
       "70              152                   Caterers\n",
       "58              150                      Vegan\n",
       "48              127                    Lounges\n",
       "46              122              Cocktail Bars\n",
       "29              117                Gluten-Free\n",
       "122             115                      Halal\n",
       "52              114                      Delis\n",
       "94              112                  Wine Bars\n",
       "84              108                Sports Bars\n",
       "61              105     Juice Bars & Smoothies\n",
       "76              105                 Gastropubs"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "# for now, use categories with at least 10 businesses\n",
    "result_df_new = result_df[result_df['business_count'] >= 100]\n",
    "display(result_df_new.sort_values('business_count',ascending=False))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<Record avgCat=2.753497481813092 minCount=0 maxCat=15>\n",
      "CPU times: user 2.42 ms, sys: 2.59 ms, total: 5.02 ms\n",
      "Wall time: 144 ms\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "# find average number of categories a business can belong to, as well as min and max\n",
    "query = \"\"\"\n",
    "        MATCH (b:Business)\n",
    "        WITH size((b)-[:IN_CATEGORY]->()) AS count\n",
    "        RETURN AVG(count) AS avgCat,  MIN(count) AS minCount, MAX(count) AS maxCat\n",
    "        \"\"\"\n",
    "\n",
    "with driver.session() as session:\n",
    "    result = session.run(query)\n",
    "\n",
    "for row in result:\n",
    "    print(row)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "%%time\n",
    "# before running label propagation, define similarity between user pairs using Jaccard index\n",
    "# this will be used as the weight for Label Propagation\n",
    "# numerator: count of categories that they've reviewed together\n",
    "# denominator: count of categories between the two of them\n",
    "# criteria: business has to be restaurant in Toronto\n",
    "# for now, keep calculation simple.  room for improvement later (ie: take into account # businesses in each category)\n",
    "\n",
    "query = \"\"\"\n",
    "        // Get user pairs and count of distinct restaurant categories that they have both reviewed\n",
    "        MATCH (u1:User)-[:REVIEWED]->(b1:Business)-[:IN_CATEGORY]->(c:Category),\n",
    "              (u2:User)-[:REVIEWED]->(b2:Business)-[:IN_CATEGORY]->(c)\n",
    "        WHERE u1 <> u2\n",
    "        RETURN u1, u2, COUNT(DISTINCT c) as intersection_count  \n",
    "        \"\"\"\n",
    "       \n",
    "\n",
    "with driver.session() as session:\n",
    "    result = session.run(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "# Get count of all the distinct categories that they have reviewed between them\n",
    "MATCH (u:User)-[:REVIEWED]->(b:Business)-[:IN_CATEGORY]->(c:Category)\n",
    "WHERE u in [u1, u2]\n",
    "WITH u1, u2, intersection_count, COUNT(DISTINCT c) as union_count\n",
    "\n",
    "// Compute Jaccard index and store it as relationship between u1 and u2\n",
    "WITH u1, u2, intersection_count, union_count, (intersection_count*1.0/union_count) as jaccard_index\n",
    "CREATE (u1)-[s:SIMILAR_TO]-(u2)\n",
    "SET s.jaccard_index = jaccard_index\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "jaccard_df = pd.DataFrame([dict(record) for record in result])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 92,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<Record nodes=6764792 iterations=10 loadMillis=29382 computeMillis=25497 writeMillis=39893 write=True partitionProperty='partition'>\n",
      "CPU times: user 6.12 ms, sys: 9.46 ms, total: 15.6 ms\n",
      "Wall time: 1min 34s\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "# incorporate weights between user pairs in order to create tighter communities\n",
    "# weightProperty - Jaccard index\n",
    "query = \"\"\"\n",
    "        CALL algo.labelPropagation(\n",
    "            'MATCH (u:User)-[:REVIEWED]->(:Business) RETURN id(u) as id',   \n",
    "            \n",
    "            'MATCH (u1:User)-[:REVIEWED]>(b1:Business)-[:IN_CATEGORY]->(c:Category),\n",
    "                   (u2:User)-[:REVIEWED]->(b2:Business)-[:IN_CATEGORY]->(c)\n",
    "\n",
    "             RETURN DISTINCT id(u1) as source, id(u2) as target', \n",
    "             'OUTGOING',\n",
    "            {graph: 'cypher', iterations:10, partitionProperty:'partition', write: true})\n",
    "        YIELD nodes, iterations, loadMillis, computeMillis, writeMillis, write, partitionProperty;\n",
    "        \"\"\"\n",
    "\n",
    "with driver.session() as session:\n",
    "    result = session.run(query)\n",
    "    \n",
    "for row in result:\n",
    "    print(row)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 100,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<Record count(DISTINCT u.partition)=872>\n",
      "CPU times: user 2.39 ms, sys: 3.24 ms, total: 5.63 ms\n",
      "Wall time: 1.99 s\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "# check number of communities\n",
    "query = \"\"\"\n",
    "        MATCH (u:User)\n",
    "        RETURN count(DISTINCT u.partition)\n",
    "        \"\"\"\n",
    "\n",
    "with driver.session() as session:\n",
    "    result = session.run(query)\n",
    "\n",
    "for row in result:\n",
    "    print(row)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 101,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<Record count(DISTINCT b.partition)=196>\n",
      "CPU times: user 2.04 ms, sys: 3.18 ms, total: 5.23 ms\n",
      "Wall time: 358 ms\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "# check number of business partitions????\n",
    "query = \"\"\"\n",
    "        MATCH (b:Business)\n",
    "        RETURN count(DISTINCT b.partition)\n",
    "        \"\"\"\n",
    "\n",
    "with driver.session() as session:\n",
    "    result = session.run(query)\n",
    "\n",
    "for row in result:\n",
    "    print(row)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "%%time\n",
    "# remove partition\n",
    "query = \"\"\"\n",
    "        MATCH (n:Review)\n",
    "        REMOVE n.partition \n",
    "        RETURN n\n",
    "        \"\"\"\n",
    "\n",
    "with driver.session() as session:\n",
    "    result = session.run(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.6.1"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
