{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "This notebook loads Yelp data related to Toronto restaurants only.  This will eventually replace the data model in the original data load module."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 273,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "from neo4j.v1 import GraphDatabase, basic_auth\n",
    "import csv\n",
    "import json\n",
    "import os\n",
    "import pandas as pd\n",
    "import matplotlib.pyplot as plt"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 274,
   "metadata": {},
   "outputs": [],
   "source": [
    "uri  = os.getenv('NEO4J_URI',  'bolt://localhost:7687')\n",
    "user = os.getenv('NEO4J_USER', 'neo4j')\n",
    "pwd  = os.getenv('NEO4J_PWD',  'neo4j')\n",
    "\n",
    "driver = GraphDatabase.driver(uri, auth=basic_auth(user, pwd))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 281,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "# contains raw JSON files\n",
    "data_dir   = '/Users/gtenorio/neo4j/neo4j/yelp_data'\n",
    "\n",
    "# contains subsetted CSV files to be loaded into Neo4j\n",
    "import_dir = '/var/lib/neo4j/import/'"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 276,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "# Helper functions\n",
    "\n",
    "# Specify CSV parameters through custom dialect\n",
    "csv.register_dialect('custom', escapechar='\\\\', quotechar='\"', quoting=csv.QUOTE_ALL)\n",
    "\n",
    "\n",
    "def identity(x): \n",
    "    return x\n",
    "\n",
    "\n",
    "def select(keys, d):\n",
    "    return {key: value for (key, value) in d.items() if key in set(keys)}\n",
    "\n",
    "\n",
    "# Converts the given value to a CSV formatted string\n",
    "def toCSV(value):\n",
    "    # Represent a list of items as a semicolon delimited string\n",
    "    if type(value) == list:\n",
    "        return ';'.join(value)\n",
    "\n",
    "    # Surround fields with double quotes and handle escape characters\n",
    "    if type(value) == str:\n",
    "        return value.replace('\"', '').replace('\\\\', '')\n",
    "\n",
    "    return value\n",
    "\n",
    "\n",
    "# Converts a dict to a list of CSV formatted strings, optionally restricting\n",
    "# converted fields by passing in an ordered list of fields\n",
    "def dictToCSV(obj, fields=None):\n",
    "    fields = fields if fields is not None else obj.keys()\n",
    "    return [toCSV(obj[k]) for k in fields]\n",
    "\n",
    "\n",
    "# Takes a JSON file and writes it as a CSV file\n",
    "def jsonToCSVFile(json_file, csv_file=None, transform=identity):\n",
    "\n",
    "    root, ext = os.path.splitext(json_file)\n",
    "    csv_file = csv_file if csv_file else root + '.csv'\n",
    "\n",
    "    with open(json_file, 'r') as jsonFile, \\\n",
    "         open(csv_file, 'w') as csvFile:\n",
    "\n",
    "        objs = transform(map(json.loads, jsonFile))\n",
    "        first = next(objs)\n",
    "        fields = first.keys()\n",
    "\n",
    "        writer = csv.writer(csvFile, dialect='custom')\n",
    "        writer.writerow(fields)         # write header\n",
    "\n",
    "        writer.writerow(dictToCSV(first, fields))\n",
    "        for obj in objs:\n",
    "            writer.writerow(dictToCSV(obj, fields))"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Part 1: Convert streaming JSON files to CSV, selecting only relevant fields."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 253,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CPU times: user 5.04 s, sys: 176 ms, total: 5.22 s\n",
      "Wall time: 5.34 s\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "\n",
    "business_fields = ['business_id', 'name', 'categories', 'neighborhood', 'stars', 'review_count']\n",
    "jsonToCSVFile(data_dir + \"business.json\",\n",
    "              transform=lambda business: (select(business_fields, b) for b in business if b[\"city\"] == 'Toronto' and 'Restaurants' in b['categories']))\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 254,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CPU times: user 58.5 s, sys: 2.24 s, total: 1min\n",
      "Wall time: 1min 1s\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "\n",
    "user_fields = ['user_id','name','average_stars']\n",
    "jsonToCSVFile(data_dir + \"user.json\", transform=lambda user: (select(user_fields, u) for u in user))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 255,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CPU times: user 2min 10s, sys: 4.87 s, total: 2min 15s\n",
      "Wall time: 2min 17s\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "review_fields = ['user_id', 'business_id', 'stars']\n",
    "jsonToCSVFile(data_dir + \"review.json\", transform=lambda review: (select(review_fields, r) for r in review))"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Part 2: Compress business.csv, user.csv and review.csv.  Upload to Neo4j cloud server."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 280,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "#!tar -czvf data_dir/business.tar.gz data_dir/business.csv\n",
    "#!tar -czvf data_dir/user.tar.gz data_dir/user.csv\n",
    "#!tar -czvf data_dir/review.tar.gz data_dir/review.csv\n",
    "\n",
    "#!scp -i ~/neo4j/devrel-datascience.pem business.tar.gz ubuntu@35.182.28.9:/home/ubuntu/grace\n",
    "#!scp -i ~/neo4j/devrel-datascience.pem user.tar.gz ubuntu@35.182.28.9:/home/ubuntu/grace\n",
    "#!scp -i ~/neo4j/devrel-datascience.pem review.tar.gz ubuntu@35.182.28.9:/home/ubuntu/grace\n",
    "\n",
    "# sudo mv /home/ubuntu/grace import_dir"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Part 3:  Create empty database and relevant constraints."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 277,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CPU times: user 4.37 ms, sys: 2.16 ms, total: 6.53 ms\n",
      "Wall time: 105 ms\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "\n",
    "# Each time this notebook is run, we start with an empty graph database\n",
    "with driver.session() as session:\n",
    "    session.run(\"MATCH (n) DETACH DELETE n\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 278,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CPU times: user 4.18 ms, sys: 2.37 ms, total: 6.56 ms\n",
      "Wall time: 158 ms\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "\n",
    "# Drop constraints from our database\n",
    "with driver.session() as session:\n",
    "    session.run(\"DROP CONSTRAINT ON (business:Business)   ASSERT business.id   IS UNIQUE\")\n",
    "    session.run(\"DROP CONSTRAINT ON (category:Category)   ASSERT category.name IS UNIQUE\")\n",
    "    session.run(\"DROP CONSTRAINT ON (user:User)           ASSERT user.id       IS UNIQUE\")\n",
    "    session.run(\"DROP CONSTRAINT ON (review:Review)       ASSERT review.id     IS UNIQUE\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 279,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CPU times: user 3.66 ms, sys: 2.29 ms, total: 5.95 ms\n",
      "Wall time: 329 ms\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "\n",
    "# Create constraints in our database\n",
    "with driver.session() as session:\n",
    "    session.run(\"CREATE CONSTRAINT ON (business:Business)   ASSERT business.id   IS UNIQUE\")\n",
    "    session.run(\"CREATE CONSTRAINT ON (category:Category)   ASSERT category.name IS UNIQUE\")\n",
    "    session.run(\"CREATE CONSTRAINT ON (user:User)           ASSERT user.id       IS UNIQUE\")\n",
    "    session.run(\"CREATE CONSTRAINT ON (review:Review)       ASSERT review.id     IS UNIQUE\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Part 4: Load business.csv into Neo4j."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 282,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CPU times: user 1.76 ms, sys: 3.23 ms, total: 4.99 ms\n",
      "Wall time: 1.28 s\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "\n",
    "load_business = \"\"\"\n",
    "    LOAD CSV WITH HEADERS FROM {input_dir} AS line                      \n",
    "    WITH line \n",
    "\n",
    "    // Create Business nodes\n",
    "    CREATE (business:Business {id: line.business_id})\n",
    "    SET business.name         = line.name,\n",
    "        business.neighborhood = line.neighborhood,\n",
    "        business.avg_rating   = toFloat(line.stars),\n",
    "        business.num_reviews  = toInteger(line.review_count)\n",
    "    \"\"\"\n",
    "\n",
    "with driver.session() as session:\n",
    "    session.run(load_business, input_dir='file:///business.csv')\n",
    "    "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 293,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style>\n",
       "    .dataframe thead tr:only-child th {\n",
       "        text-align: right;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: left;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>num_business_nodes</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>7148</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   num_business_nodes\n",
       "0                7148"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CPU times: user 5.82 ms, sys: 2.16 ms, total: 7.98 ms\n",
      "Wall time: 26.2 ms\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "\n",
    "# get number of business nodes in the graph\n",
    "query = \"\"\"\n",
    "    MATCH (b:Business)\n",
    "    RETURN COUNT(b) as num_business_nodes\n",
    "    \"\"\"\n",
    "\n",
    "with driver.session() as session:\n",
    "    business_nodes = session.run(query)\n",
    "    \n",
    "business_nodes_df = pd.DataFrame([dict(record) for record in business_nodes])\n",
    "display(business_nodes_df)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 299,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style>\n",
       "    .dataframe thead tr:only-child th {\n",
       "        text-align: right;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: left;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>name</th>\n",
       "      <th>num_reviews</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Pai Northern Thai Kitchen</td>\n",
       "      <td>1494</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Khao San Road</td>\n",
       "      <td>1270</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>KINKA IZAKAYA ORIGINAL</td>\n",
       "      <td>1184</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Banh Mi Boys</td>\n",
       "      <td>973</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Seven Lives Tacos Y Mariscos</td>\n",
       "      <td>945</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Uncle Tetsu's Japanese Cheesecake</td>\n",
       "      <td>848</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Salad King Restaurant</td>\n",
       "      <td>808</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Momofuku Noodle Bar</td>\n",
       "      <td>759</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>Sansotei Ramen</td>\n",
       "      <td>701</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>Insomnia Restaurant &amp; Lounge</td>\n",
       "      <td>690</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                name  num_reviews\n",
       "0          Pai Northern Thai Kitchen         1494\n",
       "1                      Khao San Road         1270\n",
       "2             KINKA IZAKAYA ORIGINAL         1184\n",
       "3                       Banh Mi Boys          973\n",
       "4       Seven Lives Tacos Y Mariscos          945\n",
       "5  Uncle Tetsu's Japanese Cheesecake          848\n",
       "6              Salad King Restaurant          808\n",
       "7                Momofuku Noodle Bar          759\n",
       "8                     Sansotei Ramen          701\n",
       "9       Insomnia Restaurant & Lounge          690"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "data": {
      "image/png": "iVBORw0KGgoAAAANSUhEUgAAAYAAAAD8CAYAAAB+UHOxAAAABHNCSVQICAgIfAhkiAAAAAlwSFlz\nAAALEgAACxIB0t1+/AAAFHZJREFUeJzt3X+s3fV93/HnqziQlnbYhFvPs53aWa1U9I8EdsUPpaq6\nsBhDophJKQJFw2FMnjZWpVul1jRTUSGRYJuaEmklRcGdiWiA0mRYlJV5DtW0PyCYQAg/Qn1DoLYF\n+CY2dC1qVtL3/jgfw8G9N/ccfH+Fz/MhHZ3P9/39nHPe3y8+93W/3/M9l1QVkqT+/NhSNyBJWhoG\ngCR1ygCQpE4ZAJLUKQNAkjplAEhSpwwASeqUASBJnTIAJKlTK+aakOS9wJ1DpfcAvwXc1uobgOeA\nS6vqaJIANwEXA68Cn6iqr7fn2gb8x/Y8n66qXT/stc8444zasGHDGJsjSXrkkUe+W1UTc83LOH8K\nIslJwCHgXOBq4EhV3ZBkB7Cqqn4jycXArzAIgHOBm6rq3CSnA/uASaCAR4B/UlVHZ3u9ycnJ2rdv\n38j9SZIgySNVNTnXvHFPAV0AfLuqnge2Asd+g98FXNLGW4HbauBBYGWSNcCFwJ6qOtJ+6O8Btoz5\n+pKkeTJuAFwGfKmNV1fVC238IrC6jdcCB4Yec7DVZqu/SZLtSfYl2Tc9PT1me5KkUY0cAElOBj4K\n/NHx62pwHmle/qxoVd1SVZNVNTkxMecpLEnSWzTOEcBFwNer6qW2/FI7tUO7P9zqh4D1Q49b12qz\n1SVJS2CcALicN07/AOwGtrXxNuCeofoVGTgPeKWdKrof2JxkVZJVwOZWkyQtgTkvAwVIcirwIeBf\nD5VvAO5KchXwPHBpq9/H4AqgKQaXgV4JUFVHklwPPNzmXVdVR054CyRJb8lYl4EuNi8DlaTxLdRl\noJKktwkDQJI6NdJnAD+qNuz4kyV53edu+PCSvK4kjcMjAEnqlAEgSZ0yACSpUwaAJHXKAJCkThkA\nktQpA0CSOmUASFKnDABJ6pQBIEmdMgAkqVMGgCR1ygCQpE4ZAJLUKQNAkjplAEhSpwwASeqUASBJ\nnRopAJKsTHJ3km8leTrJ+UlOT7Inyf52v6rNTZLPJZlK8niSs4eeZ1ubvz/JtoXaKEnS3EY9ArgJ\n+NOq+jngfcDTwA5gb1VtAva2ZYCLgE3tth24GSDJ6cC1wLnAOcC1x0JDkrT45gyAJKcBvwjcClBV\n/6+qXga2ArvatF3AJW28FbitBh4EViZZA1wI7KmqI1V1FNgDbJnXrZEkjWyUI4CNwDTwB0keTfKF\nJKcCq6vqhTbnRWB1G68FDgw9/mCrzVaXJC2BUQJgBXA2cHNVnQX8NW+c7gGgqgqo+WgoyfYk+5Ls\nm56eno+nlCTNYJQAOAgcrKqH2vLdDALhpXZqh3Z/uK0/BKwfevy6Vput/iZVdUtVTVbV5MTExDjb\nIkkaw5wBUFUvAgeSvLeVLgCeAnYDx67k2Qbc08a7gSva1UDnAa+0U0X3A5uTrGof/m5uNUnSElgx\n4rxfAW5PcjLwLHAlg/C4K8lVwPPApW3ufcDFwBTwaptLVR1Jcj3wcJt3XVUdmZetkCSNbaQAqKrH\ngMkZVl0ww9wCrp7leXYCO8dpUJK0MPwmsCR1ygCQpE4ZAJLUKQNAkjplAEhSpwwASeqUASBJnTIA\nJKlTBoAkdcoAkKROGQCS1CkDQJI6ZQBIUqcMAEnqlAEgSZ0yACSpUwaAJHXKAJCkThkAktQpA0CS\nOmUASFKnDABJ6tRIAZDkuSTfTPJYkn2tdnqSPUn2t/tVrZ4kn0syleTxJGcPPc+2Nn9/km0Ls0mS\npFGMcwTwT6vq/VU12ZZ3AHurahOwty0DXARsarftwM0wCAzgWuBc4Bzg2mOhIUlafCdyCmgrsKuN\ndwGXDNVvq4EHgZVJ1gAXAnuq6khVHQX2AFtO4PUlSSdg1AAo4H8meSTJ9lZbXVUvtPGLwOo2Xgsc\nGHrswVabrS5JWgIrRpz3C1V1KMlPA3uSfGt4ZVVVkpqPhlrAbAd497vfPR9PKUmawUhHAFV1qN0f\nBr7C4Bz+S+3UDu3+cJt+CFg/9PB1rTZb/fjXuqWqJqtqcmJiYrytkSSNbM4ASHJqkp86NgY2A08A\nu4FjV/JsA+5p493AFe1qoPOAV9qpovuBzUlWtQ9/N7eaJGkJjHIKaDXwlSTH5v9hVf1pkoeBu5Jc\nBTwPXNrm3wdcDEwBrwJXAlTVkSTXAw+3eddV1ZF52xJJ0ljmDICqehZ43wz17wEXzFAv4OpZnmsn\nsHP8NiVJ881vAktSpwwASeqUASBJnTIAJKlTBoAkdcoAkKROGQCS1CkDQJI6ZQBIUqcMAEnqlAEg\nSZ0yACSpUwaAJHXKAJCkThkAktQpA0CSOmUASFKnDABJ6pQBIEmdMgAkqVMGgCR1ygCQpE6NHABJ\nTkryaJJ72/LGJA8lmUpyZ5KTW/2UtjzV1m8Yeo5rWv2ZJBfO98ZIkkY3zhHAJ4Gnh5ZvBD5bVT8L\nHAWuavWrgKOt/tk2jyRnApcBPw9sAX4vyUkn1r4k6a0aKQCSrAM+DHyhLQf4IHB3m7ILuKSNt7Zl\n2voL2vytwB1V9f2q+g4wBZwzHxshSRrfqEcAvwv8OvB3bfldwMtV9VpbPgisbeO1wAGAtv6VNv/1\n+gyPeV2S7Un2Jdk3PT09xqZIksYxZwAk+QhwuKoeWYR+qKpbqmqyqiYnJiYW4yUlqUsrRpjzAeCj\nSS4G3gn8A+AmYGWSFe23/HXAoTb/ELAeOJhkBXAa8L2h+jHDj5EkLbI5jwCq6pqqWldVGxh8iPvV\nqvo48ADwsTZtG3BPG+9uy7T1X62qavXL2lVCG4FNwNfmbUskSWMZ5QhgNr8B3JHk08CjwK2tfivw\nxSRTwBEGoUFVPZnkLuAp4DXg6qr6wQm8viTpBIwVAFX1Z8CftfGzzHAVT1X9DfDLszz+M8Bnxm1S\nkjT//CawJHXKAJCkThkAktQpA0CSOmUASFKnDABJ6pQBIEmdMgAkqVMGgCR1ygCQpE4ZAJLUKQNA\nkjplAEhSpwwASeqUASBJnTIAJKlTBoAkdcoAkKROGQCS1CkDQJI6ZQBIUqfmDIAk70zytSTfSPJk\nkt9u9Y1JHkoyleTOJCe3+ilteaqt3zD0XNe0+jNJLlyojZIkzW2UI4DvAx+sqvcB7we2JDkPuBH4\nbFX9LHAUuKrNvwo42uqfbfNIciZwGfDzwBbg95KcNJ8bI0ka3ZwBUAN/1Rbf0W4FfBC4u9V3AZe0\n8da2TFt/QZK0+h1V9f2q+g4wBZwzL1shSRrbSJ8BJDkpyWPAYWAP8G3g5ap6rU05CKxt47XAAYC2\n/hXgXcP1GR4jSVpkIwVAVf2gqt4PrGPwW/vPLVRDSbYn2Zdk3/T09EK9jCR1b6yrgKrqZeAB4Hxg\nZZIVbdU64FAbHwLWA7T1pwHfG67P8Jjh17ilqiaranJiYmKc9iRJYxjlKqCJJCvb+MeBDwFPMwiC\nj7Vp24B72nh3W6at/2pVVatf1q4S2ghsAr42XxsiSRrPirmnsAbY1a7Y+THgrqq6N8lTwB1JPg08\nCtza5t8KfDHJFHCEwZU/VNWTSe4CngJeA66uqh/M7+ZIkkY1ZwBU1ePAWTPUn2WGq3iq6m+AX57l\nuT4DfGb8NiVJ881vAktSpwwASeqUASBJnTIAJKlTBoAkdcoAkKROGQCS1CkDQJI6ZQBIUqcMAEnq\nlAEgSZ0yACSpUwaAJHXKAJCkThkAktQpA0CSOmUASFKnDABJ6pQBIEmdMgAkqVMGgCR1ygCQpE7N\nGQBJ1id5IMlTSZ5M8slWPz3JniT72/2qVk+SzyWZSvJ4krOHnmtbm78/ybaF2yxJ0lxGOQJ4Dfi1\nqjoTOA+4OsmZwA5gb1VtAva2ZYCLgE3tth24GQaBAVwLnAucA1x7LDQkSYtvzgCoqheq6utt/H+B\np4G1wFZgV5u2C7ikjbcCt9XAg8DKJGuAC4E9VXWkqo4Ce4At87o1kqSRjfUZQJINwFnAQ8Dqqnqh\nrXoRWN3Ga4EDQw872Gqz1SVJS2DkAEjyk8AfA79aVX85vK6qCqj5aCjJ9iT7kuybnp6ej6eUJM1g\npABI8g4GP/xvr6ovt/JL7dQO7f5wqx8C1g89fF2rzVZ/k6q6paomq2pyYmJinG2RJI1hlKuAAtwK\nPF1VvzO0ajdw7EqebcA9Q/Ur2tVA5wGvtFNF9wObk6xqH/5ubjVJ0hJYMcKcDwD/Avhmksda7TeB\nG4C7klwFPA9c2tbdB1wMTAGvAlcCVNWRJNcDD7d511XVkXnZCknS2OYMgKr6P0BmWX3BDPMLuHqW\n59oJ7BynQUnSwvCbwJLUKQNAkjplAEhSpwwASeqUASBJnTIAJKlTBoAkdcoAkKROGQCS1CkDQJI6\nZQBIUqcMAEnqlAEgSZ0yACSpUwaAJHXKAJCkThkAktQpA0CSOmUASFKnDABJ6pQBIEmdMgAkqVNz\nBkCSnUkOJ3liqHZ6kj1J9rf7Va2eJJ9LMpXk8SRnDz1mW5u/P8m2hdkcSdKoRjkC+G/AluNqO4C9\nVbUJ2NuWAS4CNrXbduBmGAQGcC1wLnAOcO2x0JAkLY05A6Cq/jdw5LjyVmBXG+8CLhmq31YDDwIr\nk6wBLgT2VNWRqjoK7OHvh4okaRG91c8AVlfVC238IrC6jdcCB4bmHWy12ep/T5LtSfYl2Tc9Pf0W\n25MkzeWEPwSuqgJqHno59ny3VNVkVU1OTEzM19NKko7zVgPgpXZqh3Z/uNUPAeuH5q1rtdnqkqQl\n8lYDYDdw7EqebcA9Q/Ur2tVA5wGvtFNF9wObk6xqH/5ubjVJ0hJZMdeEJF8Cfgk4I8lBBlfz3ADc\nleQq4Hng0jb9PuBiYAp4FbgSoKqOJLkeeLjNu66qjv9gWZK0iOYMgKq6fJZVF8wwt4CrZ3mencDO\nsbqTJC0YvwksSZ0yACSpUwaAJHXKAJCkThkAktQpA0CSOmUASFKnDABJ6pQBIEmdMgAkqVMGgCR1\nygCQpE4ZAJLUKQNAkjplAEhSpwwASerUnP9DGI1vw44/WZLXfe6GDy/J60r60eQRgCR1ygCQpE4Z\nAJLUKQNAkjq16AGQZEuSZ5JMJdmx2K8vSRpY1ABIchLwX4GLgDOBy5OcuZg9SJIGFvsy0HOAqap6\nFiDJHcBW4KlF7uNtaakuPwUvQZV+FC12AKwFDgwtHwTOXeQetAD87oP0o2fZfREsyXZge1v8qyTP\nvMWnOgP47vx0tWDs8QTlxuXdX2OP88MeR/czo0xa7AA4BKwfWl7Xaq+rqluAW070hZLsq6rJE32e\nhWSPJ2659wf2OF/scf4t9lVADwObkmxMcjJwGbB7kXuQJLHIRwBV9VqSfwfcD5wE7KyqJxezB0nS\nwKJ/BlBV9wH3LcJLnfBppEVgjyduufcH9jhf7HGepaqWugdJ0hLwT0FIUqfedgGwXP7URJL1SR5I\n8lSSJ5N8stVPT7Inyf52v6rVk+Rzre/Hk5y9iL2elOTRJPe25Y1JHmq93Nk+sCfJKW15qq3fsEj9\nrUxyd5JvJXk6yfnLaT8m+fftv/ETSb6U5J3LYR8m2ZnkcJInhmpj77ck29r8/Um2LXB//7n9d348\nyVeSrBxad03r75kkFw7VF+w9P1OPQ+t+LUklOaMtL/o+PGFV9ba5Mfhg+dvAe4CTgW8AZy5RL2uA\ns9v4p4A/Z/DnL/4TsKPVdwA3tvHFwP8AApwHPLSIvf4H4A+Be9vyXcBlbfx54N+08b8FPt/GlwF3\nLlJ/u4B/1cYnAyuXy35k8OXG7wA/PrTvPrEc9iHwi8DZwBNDtbH2G3A68Gy7X9XGqxawv83Aija+\ncai/M9v7+RRgY3ufn7TQ7/mZemz19QwuZnkeOGOp9uEJb99SNzCvGwPnA/cPLV8DXLPUfbVe7gE+\nBDwDrGm1NcAzbfz7wOVD81+ft8B9rQP2Ah8E7m3/eL879CZ8fZ+2f/Dnt/GKNi8L3N9p7Qdsjqsv\ni/3IG99uP73tk3uBC5fLPgQ2HPcDdqz9BlwO/P5Q/U3z5ru/49b9c+D2Nn7Te/nYflyM9/xMPQJ3\nA+8DnuONAFiSfXgit7fbKaCZ/tTE2iXq5XXtMP8s4CFgdVW90Fa9CKxu46Xq/XeBXwf+ri2/C3i5\nql6boY/Xe2zrX2nzF9JGYBr4g3aa6gtJTmWZ7MeqOgT8F+AvgBcY7JNHWF77cNi4+20p31P/ksFv\n1PyQPha9vyRbgUNV9Y3jVi2bHkf1dguAZSfJTwJ/DPxqVf3l8Loa/DqwZJdhJfkIcLiqHlmqHkaw\ngsEh+M1VdRbw1wxOXbxuKfdjO4e+lUFQ/SPgVGDLUvQyrqX+9/fDJPkU8Bpw+1L3MizJTwC/CfzW\nUvcyH95uATDnn5pYTEneweCH/+1V9eVWfinJmrZ+DXC41Zei9w8AH03yHHAHg9NANwErkxz7jshw\nH6/32NafBnxvgXs8CBysqofa8t0MAmG57Md/Bnynqqar6m+BLzPYr8tpHw4bd78t+r/LJJ8APgJ8\nvIXUcurvHzMI+2+098064OtJ/uEy6nFkb7cAWDZ/aiJJgFuBp6vqd4ZW7QaOXQWwjcFnA8fqV7Qr\nCc4DXhk6VF8QVXVNVa2rqg0M9tVXq+rjwAPAx2bp8VjvH2vzF/Q3yKp6ETiQ5L2tdAGDPx++XPbj\nXwDnJfmJ9t/8WH/LZh8eZ9z9dj+wOcmqdrSzudUWRJItDE5JfrSqXj2u78vaVVQbgU3A11jk93xV\nfbOqfrqqNrT3zUEGF3u8yDLZh2NZ6g8h5vvG4JP4P2dwZcCnlrCPX2BweP048Fi7XczgfO9eYD/w\nv4DT2/ww+J/lfBv4JjC5yP3+Em9cBfQeBm+uKeCPgFNa/Z1teaqtf88i9fZ+YF/bl/+dwZUUy2Y/\nAr8NfAt4AvgigytVlnwfAl9i8LnE3zL4QXXVW9lvDM7FT7XblQvc3xSD8+XH3jOfH5r/qdbfM8BF\nQ/UFe8/P1ONx65/jjQ+BF30fnujNbwJLUqfebqeAJEkjMgAkqVMGgCR1ygCQpE4ZAJLUKQNAkjpl\nAEhSpwwASerU/wceGxWWEUYkbgAAAABJRU5ErkJggg==\n",
      "text/plain": [
       "<matplotlib.figure.Figure at 0x105bfb898>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style>\n",
       "    .dataframe thead tr:only-child th {\n",
       "        text-align: right;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: left;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>num_reviews</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>count</th>\n",
       "      <td>7148.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>mean</th>\n",
       "      <td>42.495383</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>std</th>\n",
       "      <td>73.356545</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>min</th>\n",
       "      <td>3.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10%</th>\n",
       "      <td>4.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15%</th>\n",
       "      <td>5.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20%</th>\n",
       "      <td>6.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25%</th>\n",
       "      <td>7.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>50%</th>\n",
       "      <td>18.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>60%</th>\n",
       "      <td>26.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>75%</th>\n",
       "      <td>48.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>80%</th>\n",
       "      <td>58.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>90%</th>\n",
       "      <td>104.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>max</th>\n",
       "      <td>1494.000000</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "       num_reviews\n",
       "count  7148.000000\n",
       "mean     42.495383\n",
       "std      73.356545\n",
       "min       3.000000\n",
       "10%       4.000000\n",
       "15%       5.000000\n",
       "20%       6.000000\n",
       "25%       7.000000\n",
       "50%      18.000000\n",
       "60%      26.000000\n",
       "75%      48.000000\n",
       "80%      58.000000\n",
       "90%     104.000000\n",
       "max    1494.000000"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CPU times: user 571 ms, sys: 16.8 ms, total: 587 ms\n",
      "Wall time: 667 ms\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "\n",
    "# get distribution of num_reviews for businesses\n",
    "query = \"\"\"\n",
    "        MATCH (b:Business)\n",
    "        RETURN b.name as name, b.num_reviews as num_reviews\n",
    "        ORDER BY num_reviews DESCENDING\n",
    "        \"\"\"\n",
    "\n",
    "with driver.session() as session:\n",
    "    business_reviews = session.run(query)\n",
    "\n",
    "business_reviews_df = pd.DataFrame([dict(record) for record in business_reviews])\n",
    "display(business_reviews_df.head(10))\n",
    "\n",
    "plt.hist(business_reviews_df['num_reviews'])\n",
    "plt.show()     \n",
    "display(business_reviews_df.describe(percentiles=[0.1,0.15,0.2,0.25,0.5,0.6,0.75,0.8,0.9]))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 301,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "(2976, 2)"
      ]
     },
     "execution_count": 301,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# set cut off for businesses to be 25 reviews.  check number of business nodes we will have left\n",
    "business_reviews_df[business_reviews_df.num_reviews >= 25].shape"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 302,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CPU times: user 1.71 ms, sys: 2.06 ms, total: 3.77 ms\n",
      "Wall time: 278 ms\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "\n",
    "# delete businesses with less than 25 reviews\n",
    "query = \"\"\"\n",
    "        MATCH (b:Business)\n",
    "        WHERE b.num_reviews < 25\n",
    "        DELETE b\n",
    "        \"\"\"\n",
    "\n",
    "with driver.session() as session:\n",
    "    result = session.run(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 305,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style>\n",
       "    .dataframe thead tr:only-child th {\n",
       "        text-align: right;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: left;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>num_business</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>2976</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   num_business\n",
       "0          2976"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CPU times: user 5.43 ms, sys: 1.25 ms, total: 6.68 ms\n",
      "Wall time: 41.9 ms\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "\n",
    "# confirm that we have 2976 business nodes left\n",
    "query = \"\"\"\n",
    "        MATCH (b:Business)\n",
    "        RETURN COUNT(b) as num_business\n",
    "        \"\"\"\n",
    "\n",
    "with driver.session() as session:\n",
    "    business_nodes_remaining = session.run(query)\n",
    "    \n",
    "business_nodes_remaining_df = pd.DataFrame([dict(record) for record in business_nodes_remaining])\n",
    "display(business_nodes_remaining_df)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Part 5: Load category data, only for businesses already in the graph. "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 306,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CPU times: user 1.65 ms, sys: 2.6 ms, total: 4.24 ms\n",
      "Wall time: 968 ms\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "\n",
    "load_category = \"\"\"\n",
    "    LOAD CSV WITH HEADERS FROM {input_dir} AS line                      \n",
    "    WITH line \n",
    "\n",
    "    // Only load categories associated with businesses that are already in the graph.\n",
    "    MATCH (business:Business {id: line.business_id})\n",
    "   \n",
    "    // Create Category nodes\n",
    "    WITH line, business, split(line.categories, \";\") as cat_list\n",
    "    UNWIND cat_list as cat\n",
    "    MERGE (category:Category {name: cat})\n",
    "    CREATE (business)-[:IN_CATEGORY]->(category)\n",
    "    \"\"\"\n",
    "\n",
    "with driver.session() as session:\n",
    "    session.run(load_category, input_dir='file:///business.csv')\n",
    "    "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 307,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style>\n",
       "    .dataframe thead tr:only-child th {\n",
       "        text-align: right;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: left;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>num_category</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>252</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   num_category\n",
       "0           252"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CPU times: user 6.18 ms, sys: 2.22 ms, total: 8.4 ms\n",
      "Wall time: 90 ms\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "# count number of categories in the graph\n",
    "\n",
    "query = \"\"\"\n",
    "        MATCH (c:Category)\n",
    "        RETURN COUNT(c) as num_category\n",
    "        \"\"\"\n",
    "\n",
    "with driver.session() as session:\n",
    "    category_count = session.run(query)\n",
    "    \n",
    "category_count_df = pd.DataFrame([dict(record) for record in category_count])\n",
    "display(category_count_df)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 316,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style>\n",
       "    .dataframe thead tr:only-child th {\n",
       "        text-align: right;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: left;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>name</th>\n",
       "      <th>num_business_in_cat</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Restaurants</td>\n",
       "      <td>2976</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Food</td>\n",
       "      <td>594</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Nightlife</td>\n",
       "      <td>549</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Bars</td>\n",
       "      <td>538</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>44</th>\n",
       "      <td>Canadian (New)</td>\n",
       "      <td>353</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>33</th>\n",
       "      <td>Breakfast &amp; Brunch</td>\n",
       "      <td>308</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>Japanese</td>\n",
       "      <td>298</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>48</th>\n",
       "      <td>Italian</td>\n",
       "      <td>265</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22</th>\n",
       "      <td>Sandwiches</td>\n",
       "      <td>208</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>Chinese</td>\n",
       "      <td>196</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                  name  num_business_in_cat\n",
       "3          Restaurants                 2976\n",
       "6                 Food                  594\n",
       "1            Nightlife                  549\n",
       "4                 Bars                  538\n",
       "44      Canadian (New)                  353\n",
       "33  Breakfast & Brunch                  308\n",
       "15            Japanese                  298\n",
       "48             Italian                  265\n",
       "22          Sandwiches                  208\n",
       "12             Chinese                  196"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "data": {
      "image/png": "iVBORw0KGgoAAAANSUhEUgAAAXoAAAD8CAYAAAB5Pm/hAAAABHNCSVQICAgIfAhkiAAAAAlwSFlz\nAAALEgAACxIB0t1+/AAADydJREFUeJzt3F2sXFd5xvH/0ySEikSNU59armPqBLmqjNSa6ChNBUK0\nUfNhLhwkFDkXYNFIRm0igUQvDEglvYgUqgIqEg0yTYSpKCHlQ7FEKBg3EuKCBCc1jp005ACOYsux\nDYEQhESb8PZilsnUtc+Z8zE5Z1b/P2k0a6+99+x3ec95PLNmz6SqkCT16zeWuwBJ0ngZ9JLUOYNe\nkjpn0EtS5wx6SeqcQS9JnTPoJalzBr0kdc6gl6TOnb/cBQCsXr26NmzYsNxlSNJEeeSRR35UVVNz\nbbcign7Dhg3s379/ucuQpImS5OlRtnPqRpI6Z9BLUufmDPok65M8mOTxJIeTvKf1357kWJID7bZl\naJ/3J5lJ8mSS68Y5AEnS7EaZo38ReF9VPZrkYuCRJHvbuo9V1d8Pb5xkE7ANeD3wu8A3kvx+Vb20\nlIVLkkYz5yv6qjpeVY+29gvAE8C6WXbZCtxbVb+sqh8CM8BVS1GsJGn+5jVHn2QD8AbgodZ1W5KD\nSe5Jsqr1rQOeGdrtKGf5jyHJjiT7k+w/derUvAuXJI1m5KBPchHwReC9VfUz4C7gdcBm4Djwkfkc\nuKp2VdV0VU1PTc15GagkaYFGCvokFzAI+c9W1ZcAqupEVb1UVb8CPsXL0zPHgPVDu1/W+iRJy2CU\nq24C3A08UVUfHepfO7TZ24BDrb0H2JbkwiSXAxuBh5euZEnSfIxy1c0bgXcAjyU50Po+ANycZDNQ\nwBHg3QBVdTjJfcDjDK7YuXWcV9xs2PmVcT30nI7c+dZlO7YkjWrOoK+qbwE5y6oHZtnnDuCORdQl\nSVoifjNWkjpn0EtS5wx6SeqcQS9JnTPoJalzBr0kdc6gl6TOGfSS1DmDXpI6Z9BLUucMeknqnEEv\nSZ0z6CWpcwa9JHXOoJekzhn0ktQ5g16SOmfQS1LnDHpJ6pxBL0mdM+glqXMGvSR1zqCXpM4Z9JLU\nOYNekjpn0EtS5wx6SeqcQS9JnTPoJalzBr0kdc6gl6TOGfSS1DmDXpI6N2fQJ1mf5MEkjyc5nOQ9\nrf/SJHuTPNXuV7X+JPl4kpkkB5NcOe5BSJLObZRX9C8C76uqTcDVwK1JNgE7gX1VtRHY15YBbgA2\nttsO4K4lr1qSNLI5g76qjlfVo639AvAEsA7YCuxum+0GbmztrcBnauDbwCVJ1i555ZKkkcxrjj7J\nBuANwEPAmqo63lY9C6xp7XXAM0O7HW19Zz7WjiT7k+w/derUPMuWJI1q5KBPchHwReC9VfWz4XVV\nVUDN58BVtauqpqtqempqaj67SpLmYaSgT3IBg5D/bFV9qXWfOD0l0+5Ptv5jwPqh3S9rfZKkZTDK\nVTcB7gaeqKqPDq3aA2xv7e3A/UP972xX31wNPD80xSNJeoWdP8I2bwTeATyW5EDr+wBwJ3BfkluA\np4Gb2roHgC3ADPAL4F1LWrEkaV7mDPqq+haQc6y+5izbF3DrIuuSJC0RvxkrSZ0z6CWpcwa9JHXO\noJekzhn0ktQ5g16SOmfQS1LnDHpJ6pxBL0mdM+glqXMGvSR1zqCXpM4Z9JLUOYNekjpn0EtS5wx6\nSeqcQS9JnTPoJalzBr0kdc6gl6TOGfSS1DmDXpI6Z9BLUucMeknqnEEvSZ0z6CWpcwa9JHXOoJek\nzhn0ktQ5g16SOmfQS1LnDHpJ6pxBL0mdmzPok9yT5GSSQ0N9tyc5luRAu20ZWvf+JDNJnkxy3bgK\nlySNZpRX9J8Grj9L/8eqanO7PQCQZBOwDXh92+cfk5y3VMVKkuZvzqCvqm8Cz434eFuBe6vql1X1\nQ2AGuGoR9UmSFmkxc/S3JTnYpnZWtb51wDND2xxtfZKkZbLQoL8LeB2wGTgOfGS+D5BkR5L9Sfaf\nOnVqgWVIkuayoKCvqhNV9VJV/Qr4FC9PzxwD1g9telnrO9tj7Kqq6aqanpqaWkgZkqQRLCjok6wd\nWnwbcPqKnD3AtiQXJrkc2Ag8vLgSJUmLcf5cGyT5HPAWYHWSo8CHgLck2QwUcAR4N0BVHU5yH/A4\n8CJwa1W9NJ7SJUmjmDPoq+rms3TfPcv2dwB3LKYoSdLS8ZuxktQ5g16SOmfQS1LnDHpJ6pxBL0md\nM+glqXMGvSR1zqCXpM4Z9JLUOYNekjpn0EtS5wx6SeqcQS9JnTPoJalzBr0kdc6gl6TOGfSS1DmD\nXpI6Z9BLUucMeknqnEEvSZ0z6CWpcwa9JHXOoJekzhn0ktQ5g16SOmfQS1LnDHpJ6pxBL0mdM+gl\nqXMGvSR1zqCXpM4Z9JLUuTmDPsk9SU4mOTTUd2mSvUmeaverWn+SfDzJTJKDSa4cZ/GSpLmN8or+\n08D1Z/TtBPZV1UZgX1sGuAHY2G47gLuWpkxJ0kLNGfRV9U3guTO6twK7W3s3cONQ/2dq4NvAJUnW\nLlWxkqT5W+gc/ZqqOt7azwJrWnsd8MzQdkdbnyRpmSz6w9iqKqDmu1+SHUn2J9l/6tSpxZYhSTqH\nhQb9idNTMu3+ZOs/Bqwf2u6y1vd/VNWuqpququmpqakFliFJmstCg34PsL21twP3D/W/s119czXw\n/NAUjyRpGZw/1wZJPge8BVid5CjwIeBO4L4ktwBPAze1zR8AtgAzwC+Ad42hZknSPMwZ9FV18zlW\nXXOWbQu4dbFFSZKWjt+MlaTOGfSS1DmDXpI6Z9BLUucMeknqnEEvSZ0z6CWpcwa9JHXOoJekzhn0\nktQ5g16SOmfQS1LnDHpJ6pxBL0mdM+glqXMGvSR1zqCXpM4Z9JLUOYNekjpn0EtS5wx6SeqcQS9J\nnTPoJalzBr0kdc6gl6TOGfSS1DmDXpI6Z9BLUucMeknqnEEvSZ0z6CWpcwa9JHXOoJekzp2/mJ2T\nHAFeAF4CXqyq6SSXAp8HNgBHgJuq6ieLK1OStFBL8Yr+T6tqc1VNt+WdwL6q2gjsa8uSpGUyjqmb\nrcDu1t4N3DiGY0iSRrTYoC/g60keSbKj9a2pquOt/SywZpHHkCQtwqLm6IE3VdWxJL8D7E3yn8Mr\nq6qS1Nl2bP8x7AB47Wtfu8gyJEnnsqhX9FV1rN2fBL4MXAWcSLIWoN2fPMe+u6pquqqmp6amFlOG\nJGkWCw76JK9JcvHpNnAtcAjYA2xvm20H7l9skZKkhVvM1M0a4MtJTj/Ov1TVvyX5DnBfkluAp4Gb\nFl+mJGmhFhz0VfUD4I/O0v9j4JrFFCVJWjp+M1aSOmfQS1LnDHpJ6pxBL0mdM+glqXMGvSR1zqCX\npM4Z9JLUOYNekjpn0EtS5wx6SeqcQS9JnTPoJalzBr0kdc6gl6TOGfSS1DmDXpI6Z9BLUucMeknq\nnEEvSZ0z6CWpcwa9JHXOoJekzhn0ktQ5g16SOmfQS1LnDHpJ6pxBL0mdM+glqXMGvSR1zqCXpM4Z\n9JLUOYNekjp3/rgeOMn1wD8A5wH/VFV3jutYy2XDzq8sy3GP3PnWZTmupMk0llf0Sc4DPgHcAGwC\nbk6yaRzHkiTNblxTN1cBM1X1g6r6L+BeYOuYjiVJmsW4pm7WAc8MLR8F/nhMx5KkRVmuaVh4ZaZi\nxzZHP5ckO4AdbfHnSZ5c4EOtBn60NFUtu5HGkg+/ApUsjf9352ZCOJYVZOjveSFj+b1RNhpX0B8D\n1g8tX9b6fq2qdgG7FnugJPuranqxj7MS9DQW6Gs8jmVlciyjGdcc/XeAjUkuT/IqYBuwZ0zHkiTN\nYiyv6KvqxSS3AV9jcHnlPVV1eBzHkiTNbmxz9FX1APDAuB5/yKKnf1aQnsYCfY3HsaxMjmUEqapx\nPbYkaQXwJxAkqXMTHfRJrk/yZJKZJDuXu55RJDmS5LEkB5Lsb32XJtmb5Kl2v6r1J8nH2/gOJrly\nmWu/J8nJJIeG+uZde5LtbfunkmxfQWO5Pcmxdm4OJNkytO79bSxPJrluqH/Zn4NJ1id5MMnjSQ4n\neU/rn7hzM8tYJu7cJHl1koeTfLeN5W9b/+VJHmp1fb5dsEKSC9vyTFu/Ya4xjqyqJvLG4EPe7wNX\nAK8CvgtsWu66Rqj7CLD6jL6/A3a29k7gw629BfgqEOBq4KFlrv3NwJXAoYXWDlwK/KDdr2rtVStk\nLLcDf32WbTe159eFwOXteXfeSnkOAmuBK1v7YuB7reaJOzezjGXizk37972otS8AHmr/3vcB21r/\nJ4G/bO2/Aj7Z2tuAz882xvnUMsmv6Hv6mYWtwO7W3g3cONT/mRr4NnBJkrXLUSBAVX0TeO6M7vnW\nfh2wt6qeq6qfAHuB68df/f92jrGcy1bg3qr6ZVX9EJhh8PxbEc/BqjpeVY+29gvAEwy+nT5x52aW\nsZzLij037d/3523xgnYr4M+AL7T+M8/L6fP1BeCaJOHcYxzZJAf92X5mYbYnxEpRwNeTPJLBt4MB\n1lTV8dZ+FljT2pMwxvnWvtLHdFubzrjn9FQHEzSW9nb/DQxePU70uTljLDCB5ybJeUkOACcZ/Mf5\nfeCnVfXiWer6dc1t/fPAb7MEY5nkoJ9Ub6qqKxn8suetSd48vLIG79Um8lKoSa69uQt4HbAZOA58\nZHnLmZ8kFwFfBN5bVT8bXjdp5+YsY5nIc1NVL1XVZga/DnAV8AfLUcckB/2cP7OwElXVsXZ/Evgy\ng5N/4vSUTLs/2TafhDHOt/YVO6aqOtH+MH8FfIqX3x6v+LEkuYBBMH62qr7Uuify3JxtLJN8bgCq\n6qfAg8CfMJgqO/0dpuG6fl1zW/9bwI9ZgrFMctBP3M8sJHlNkotPt4FrgUMM6j59hcN24P7W3gO8\ns10lcTXw/NBb8ZVivrV/Dbg2yar29vva1rfszvj8420Mzg0MxrKtXRVxObAReJgV8hxs87h3A09U\n1UeHVk3cuTnXWCbx3CSZSnJJa/8m8OcMPnN4EHh72+zM83L6fL0d+Pf2TuxcYxzdK/kp9FLfGFw9\n8D0G814fXO56Rqj3Cgafnn8XOHy6ZgbzcPuAp4BvAJfWy5/af6KN7zFgepnr/xyDt83/zWCe8JaF\n1A78BYMPlGaAd62gsfxzq/Vg++NaO7T9B9tYngRuWEnPQeBNDKZlDgIH2m3LJJ6bWcYycecG+EPg\nP1rNh4C/af1XMAjqGeBfgQtb/6vb8kxbf8VcYxz15jdjJalzkzx1I0kagUEvSZ0z6CWpcwa9JHXO\noJekzhn0ktQ5g16SOmfQS1Ln/gfakfQxgTFDUgAAAABJRU5ErkJggg==\n",
      "text/plain": [
       "<matplotlib.figure.Figure at 0x10a7b1320>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style>\n",
       "    .dataframe thead tr:only-child th {\n",
       "        text-align: right;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: left;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>num_business_in_cat</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>count</th>\n",
       "      <td>252.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>mean</th>\n",
       "      <td>47.742063</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>std</th>\n",
       "      <td>201.653249</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>min</th>\n",
       "      <td>1.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10%</th>\n",
       "      <td>1.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15%</th>\n",
       "      <td>1.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20%</th>\n",
       "      <td>1.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25%</th>\n",
       "      <td>1.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>50%</th>\n",
       "      <td>6.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>60%</th>\n",
       "      <td>10.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>75%</th>\n",
       "      <td>29.750000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>80%</th>\n",
       "      <td>49.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>90%</th>\n",
       "      <td>99.900000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>max</th>\n",
       "      <td>2976.000000</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "       num_business_in_cat\n",
       "count           252.000000\n",
       "mean             47.742063\n",
       "std             201.653249\n",
       "min               1.000000\n",
       "10%               1.000000\n",
       "15%               1.000000\n",
       "20%               1.000000\n",
       "25%               1.000000\n",
       "50%               6.000000\n",
       "60%              10.000000\n",
       "75%              29.750000\n",
       "80%              49.000000\n",
       "90%              99.900000\n",
       "max            2976.000000"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CPU times: user 286 ms, sys: 12.7 ms, total: 298 ms\n",
      "Wall time: 327 ms\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "\n",
    "# count number of businesses in a category\n",
    "query = \"\"\"\n",
    "        MATCH (c:Category)\n",
    "        RETURN c.name as name, size(()-[:IN_CATEGORY]->(c)) AS num_business_in_cat   \n",
    "        ORDER BY c, num_business_in_cat DESC\n",
    "        \"\"\"\n",
    "\n",
    "with driver.session() as session:\n",
    "    business_in_category_count = session.run(query)\n",
    "\n",
    "business_in_category_count_df = pd.DataFrame([dict(record) for record in business_in_category_count])\n",
    "display(business_in_category_count_df.sort_values('num_business_in_cat', ascending=False).head(10))\n",
    "\n",
    "plt.hist(business_in_category_count_df['num_business_in_cat'])\n",
    "plt.show()     \n",
    "display(business_in_category_count_df.describe(percentiles=[0.1,0.15,0.2,0.25,0.5,0.6,0.75,0.8,0.9]))\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 317,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "(105, 2)"
      ]
     },
     "execution_count": 317,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# set cut off for categories to be 10 businesses.  check number of category nodes we will have left\n",
    "business_in_category_count_df[business_in_category_count_df.num_business_in_cat >= 10].shape"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 335,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "147"
      ]
     },
     "execution_count": 335,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# get a list of categories with less than 10 businesses\n",
    "categories_to_delete = business_in_category_count_df[business_in_category_count_df.num_business_in_cat <  10]['name'].tolist()\n",
    "len(categories_to_delete)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 336,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "12"
      ]
     },
     "execution_count": 336,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# other categories to delete\n",
    "other_categories_to_delete = ['Restaurants','Food','Grocery','Event Planning & Services','Venues & Event Spaces','Caterers','Food Delivery Services','Shopping','Arts & Entertainment','Music Venues','Lounges','Food Service Delivery']\n",
    "len(other_categories_to_delete)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 337,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "159"
      ]
     },
     "execution_count": 337,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# combine categories to delete\n",
    "all_categories_to_delete = categories_to_delete + other_categories_to_delete\n",
    "len(all_categories_to_delete)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 340,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style>\n",
       "    .dataframe thead tr:only-child th {\n",
       "        text-align: right;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: left;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>COUNT(r)</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>4308</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   COUNT(r)\n",
       "0      4308"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CPU times: user 7.84 ms, sys: 2.54 ms, total: 10.4 ms\n",
      "Wall time: 94.8 ms\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "\n",
    "# look at number of relationships that must be first removed, before removing the categories above\n",
    "query = \"\"\"\n",
    "        MATCH (c:Category)<-[r:IN_CATEGORY]-()\n",
    "        WHERE c.name in {category_list}\n",
    "        RETURN COUNT(r)\n",
    "        \"\"\"\n",
    "\n",
    "with driver.session() as session:\n",
    "    cat_to_delete = session.run(query, category_list = all_categories_to_delete)\n",
    "\n",
    "\n",
    "cat_to_delete_df = pd.DataFrame([dict(record) for record in cat_to_delete])\n",
    "    \n",
    "display(cat_to_delete_df)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 341,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CPU times: user 3.09 ms, sys: 1.59 ms, total: 4.69 ms\n",
      "Wall time: 142 ms\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "\n",
    "# delete relationships\n",
    "query = \"\"\"\n",
    "        MATCH (c:Category)<-[r:IN_CATEGORY]-()\n",
    "        WHERE c.name in {category_list}\n",
    "        DELETE r\n",
    "        \"\"\"\n",
    "\n",
    "with driver.session() as session:\n",
    "    result = session.run(query, category_list = all_categories_to_delete)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 342,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CPU times: user 2.85 ms, sys: 2.7 ms, total: 5.55 ms\n",
      "Wall time: 77.5 ms\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "\n",
    "# now remove nodes corresponding to categories to be deleted\n",
    "query = \"\"\"\n",
    "        MATCH (c:Category)\n",
    "        WHERE c.name in {category_list}\n",
    "        DELETE c\n",
    "        \"\"\"\n",
    "\n",
    "with driver.session() as session:\n",
    "    result = session.run(query, category_list = all_categories_to_delete)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 343,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style>\n",
       "    .dataframe thead tr:only-child th {\n",
       "        text-align: right;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: left;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>num_categories</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>94</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   num_categories\n",
       "0              94"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CPU times: user 8.89 ms, sys: 2.71 ms, total: 11.6 ms\n",
      "Wall time: 223 ms\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "\n",
    "# check number of categories we have remaining\n",
    "query = \"\"\"\n",
    "        MATCH (c:Category)\n",
    "        RETURN COUNT(c) as num_categories\n",
    "        \"\"\"\n",
    "\n",
    "with driver.session() as session:\n",
    "    category_nodes_remaining = session.run(query)\n",
    "    \n",
    "category_nodes_remaining_df = pd.DataFrame([dict(record) for record in category_nodes_remaining])\n",
    "display(category_nodes_remaining_df)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 352,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style>\n",
       "    .dataframe thead tr:only-child th {\n",
       "        text-align: right;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: left;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>business</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Olly Fresco's</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Das Gasthaus</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Budapest Restaurant</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>CASA manila</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Platito Filipino Soul Food</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Satay Sate</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Lamesa Filipino Kitchen</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Julie's Cuban Restaurant</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>Bamiyan Kabob</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>Otto's Bierhalle</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>Pamier Kabob</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>Goodlake</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>Tinuno</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                      business\n",
       "0                Olly Fresco's\n",
       "1                 Das Gasthaus\n",
       "2          Budapest Restaurant\n",
       "3                  CASA manila\n",
       "4   Platito Filipino Soul Food\n",
       "5                   Satay Sate\n",
       "6      Lamesa Filipino Kitchen\n",
       "7     Julie's Cuban Restaurant\n",
       "8                Bamiyan Kabob\n",
       "9             Otto's Bierhalle\n",
       "10                Pamier Kabob\n",
       "11                    Goodlake\n",
       "12                      Tinuno"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CPU times: user 8.04 ms, sys: 2.4 ms, total: 10.4 ms\n",
      "Wall time: 40.2 ms\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "\n",
    "# with the removal of category nodes, there may be some businesses not belonging to a category\n",
    "query = \"\"\"\n",
    "        MATCH (b:Business)\n",
    "        WHERE NOT (b)-[:IN_CATEGORY]->()\n",
    "        RETURN b.name as business\n",
    "        \"\"\"\n",
    "\n",
    "with driver.session() as session:\n",
    "    orphan_business = session.run(query)\n",
    "    \n",
    "orphan_business_df = pd.DataFrame([dict(record) for record in orphan_business])\n",
    "display(orphan_business_df)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 358,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "13"
      ]
     },
     "execution_count": 358,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# get a list of categories with less than 10 businesses\n",
    "orphan_businesses_to_delete = orphan_business_df['business'].tolist()\n",
    "len(orphan_businesses_to_delete)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 361,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CPU times: user 1.92 ms, sys: 2.31 ms, total: 4.23 ms\n",
      "Wall time: 66.7 ms\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "\n",
    "# remove these orphan business nodes\n",
    "\n",
    "query = \"\"\"\n",
    "        MATCH (b:Business)\n",
    "        WHERE b.name in {business_list}\n",
    "        DELETE b\n",
    "        \"\"\"\n",
    "\n",
    "with driver.session() as session:\n",
    "    delete_orphan_businesses = session.run(query, business_list = orphan_businesses_to_delete)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 362,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style>\n",
       "    .dataframe thead tr:only-child th {\n",
       "        text-align: right;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: left;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>COUNT(b)</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>2963</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   COUNT(b)\n",
       "0      2963"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CPU times: user 6.26 ms, sys: 2.37 ms, total: 8.63 ms\n",
      "Wall time: 33.2 ms\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "\n",
    "# check number of business nodes we have remaining\n",
    "query = \"\"\"\n",
    "        MATCH (b:Business)\n",
    "        RETURN COUNT(b)\n",
    "        \"\"\"\n",
    "\n",
    "with driver.session() as session:\n",
    "    business_nodes_remaining = session.run(query)\n",
    "    \n",
    "business_nodes_remaining_df = pd.DataFrame([dict(record) for record in business_nodes_remaining])\n",
    "display(business_nodes_remaining_df.head())\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Part 6.  Load review.csv, but only reviews for businesses already in the graph."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 379,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CPU times: user 3.87 ms, sys: 3.43 ms, total: 7.3 ms\n",
      "Wall time: 1min\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "\n",
    "load_review = \"\"\"\n",
    "    // Load and commit every 50000 records\n",
    "    USING PERIODIC COMMIT 50000 \n",
    "    LOAD CSV WITH HEADERS FROM {input_dir} AS line                      \n",
    "    WITH line \n",
    "\n",
    "    // Only care about businesses that are already in the graph\n",
    "    MATCH (business:Business {id:line.business_id})\n",
    "    MERGE (user:User         {id:line.user_id})\n",
    "    \n",
    "    CREATE (user)-[:REVIEWED  {stars:toInteger(line.stars)}]->(business)\n",
    "    \"\"\"\n",
    "\n",
    "with driver.session() as session:\n",
    "    session.run(load_review, input_dir='file:///review.csv')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 383,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style>\n",
       "    .dataframe thead tr:only-child th {\n",
       "        text-align: right;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: left;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>id</th>\n",
       "      <th>num_business_reviewed</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>--7gjElmOrthETJ8XqzMBw</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>--Br-QsbO9ad5GbZxVGxaw</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>--BumyUHiO_7YsHurb9Hkw</td>\n",
       "      <td>29</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>--DKDJlRHfsvufdGSk_Sdw</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>--EVSb3jbKVL3WJ5NUCuCA</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>--KQJPdrU0Md97DiOliDzw</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>--Qh8yKWAvIP4V4K8ZPfHA</td>\n",
       "      <td>170</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>--RYvmB6UYRyZQqXkBv4eQ</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>--UOvCH5qEgdNQ8lzR8QYQ</td>\n",
       "      <td>7</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>--WhK4MJx0fKvg64LqwStg</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                       id  num_business_reviewed\n",
       "0  --7gjElmOrthETJ8XqzMBw                      1\n",
       "1  --Br-QsbO9ad5GbZxVGxaw                      1\n",
       "2  --BumyUHiO_7YsHurb9Hkw                     29\n",
       "3  --DKDJlRHfsvufdGSk_Sdw                      1\n",
       "4  --EVSb3jbKVL3WJ5NUCuCA                      1\n",
       "5  --KQJPdrU0Md97DiOliDzw                      1\n",
       "6  --Qh8yKWAvIP4V4K8ZPfHA                    170\n",
       "7  --RYvmB6UYRyZQqXkBv4eQ                      1\n",
       "8  --UOvCH5qEgdNQ8lzR8QYQ                      7\n",
       "9  --WhK4MJx0fKvg64LqwStg                      1"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CPU times: user 2.38 s, sys: 33.9 ms, total: 2.42 s\n",
      "Wall time: 2.64 s\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "# get number of businesses reviewed by user\n",
    "\n",
    "query = \"\"\"\n",
    "        MATCH (u:User)\n",
    "        RETURN u.id as id, size((u)-[:REVIEWED]->()) AS num_business_reviewed   \n",
    "        ORDER BY id, num_business_reviewed DESC\n",
    "        \"\"\"\n",
    "\n",
    "with driver.session() as session:\n",
    "    user_review_count = session.run(query)\n",
    "\n",
    "\n",
    "user_review_count_df = pd.DataFrame([dict(record) for record in user_review_count])\n",
    "    \n",
    "display(user_review_count_df.head(10))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 386,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "image/png": "iVBORw0KGgoAAAANSUhEUgAAAYcAAAD8CAYAAACcjGjIAAAABHNCSVQICAgIfAhkiAAAAAlwSFlz\nAAALEgAACxIB0t1+/AAAE4BJREFUeJzt3G2sXdV95/Hvr3ZImLTBJtyxkE3GVLEaudHwEAuMElUt\nqMaQquZFGoGqsRVZ8Ys4o1Sq1DEz0qAmjZS8KQ1SigYFF1NlSihtBos6cT2GquoLHi6FAMZhfENA\ntgXYiQ1MGzUZ0v+8OMvpidc19/jx3Mv9fqSjs/Z/rb3PWvaxf/fsvc9NVSFJ0rBfGPcEJEmzj+Eg\nSeoYDpKkjuEgSeoYDpKkjuEgSeoYDpKkjuEgSeoYDpKkzsJxT+BUXXTRRbV8+fJxT0OS5ownn3zy\nB1U1McrYORsOy5cvZ3JyctzTkKQ5I8nLo471tJIkqWM4SJI6hoMkqWM4SJI6hoMkqWM4SJI6hoMk\nqWM4SJI6hoMkqTNnvyF9OpZv+ZuxvO5LX/r4WF5Xkk6WnxwkSR3DQZLUMRwkSR3DQZLUMRwkSR3D\nQZLUMRwkSR3DQZLUMRwkSR3DQZLUMRwkSR3DQZLUMRwkSR3DQZLUMRwkSZ2RwiHJoiQPJPlukr1J\nrklyYZJdSfa158VtbJLckWQqyTNJrhw6zoY2fl+SDUP1jyR5tu1zR5Kc+aVKkkY16ieHrwDfrqoP\nAZcBe4EtwO6qWgHsbtsANwAr2mMTcCdAkguB24CrgauA244FShvz6aH91p7esiRJp2PGcEhyAfBr\nwN0AVfWTqnodWAdsa8O2ATe19jrg3hp4FFiU5GLgemBXVR2pqqPALmBt63tfVT1aVQXcO3QsSdIY\njPLJ4VLgMPBnSZ5K8rUk7wWWVNUrbcyrwJLWXgrsH9r/QKu9Xf3ANPVOkk1JJpNMHj58eISpS5JO\nxSjhsBC4Erizqq4A/pl/O4UEQPuJv8789H5eVd1VVauqatXExMTZfjlJmrdGCYcDwIGqeqxtP8Ag\nLF5rp4Roz4da/0HgkqH9l7Xa29WXTVOXJI3JjOFQVa8C+5P8SitdBzwPbAeO3XG0AXiwtbcD69td\nS6uBN9rpp53AmiSL24XoNcDO1vdmktXtLqX1Q8eSJI3BwhHH/Wfg60nOA14EPsUgWO5PshF4Gfhk\nG7sDuBGYAn7UxlJVR5J8AXiijft8VR1p7c8A9wDnA99qD0nSmIwUDlX1NLBqmq7rphlbwOYTHGcr\nsHWa+iTw4VHmIkk6+/yGtCSpYzhIkjqGgySpYzhIkjqGgySpYzhIkjqGgySpYzhIkjqGgySpYzhI\nkjqGgySpYzhIkjqGgySpYzhIkjqGgySpYzhIkjqGgySpYzhIkjqGgySpYzhIkjqGgySpYzhIkjoj\nhUOSl5I8m+TpJJOtdmGSXUn2tefFrZ4kdySZSvJMkiuHjrOhjd+XZMNQ/SPt+FNt35zphUqSRncy\nnxx+o6our6pVbXsLsLuqVgC72zbADcCK9tgE3AmDMAFuA64GrgJuOxYobcynh/Zbe8orkiSdttM5\nrbQO2Nba24Cbhur31sCjwKIkFwPXA7uq6khVHQV2AWtb3/uq6tGqKuDeoWNJksZg1HAo4G+TPJlk\nU6stqapXWvtVYElrLwX2D+17oNXern5gmrokaUwWjjjuY1V1MMm/B3Yl+e5wZ1VVkjrz0/t5LZg2\nAXzgAx842y8nSfPWSJ8cqupgez4EfJPBNYPX2ikh2vOhNvwgcMnQ7sta7e3qy6apTzePu6pqVVWt\nmpiYGGXqkqRTMGM4JHlvkl861gbWAM8B24FjdxxtAB5s7e3A+nbX0mrgjXb6aSewJsnidiF6DbCz\n9b2ZZHW7S2n90LEkSWMwymmlJcA3292lC4H/WVXfTvIEcH+SjcDLwCfb+B3AjcAU8CPgUwBVdSTJ\nF4An2rjPV9WR1v4McA9wPvCt9pAkjcmM4VBVLwKXTVP/IXDdNPUCNp/gWFuBrdPUJ4EPjzBfSdI5\n4DekJUkdw0GS1DEcJEkdw0GS1DEcJEkdw0GS1DEcJEkdw0GS1DEcJEkdw0GS1DEcJEkdw0GS1DEc\nJEkdw0GS1DEcJEkdw0GS1DEcJEkdw0GS1DEcJEkdw0GS1DEcJEkdw0GS1Bk5HJIsSPJUkofa9qVJ\nHksyleQbSc5r9Xe37anWv3zoGLe2+gtJrh+qr221qSRbztzyJEmn4mQ+OXwO2Du0/WXg9qr6IHAU\n2NjqG4GjrX57G0eSlcDNwK8Ca4E/bYGzAPgqcAOwEriljZUkjclI4ZBkGfBx4GttO8C1wANtyDbg\nptZe17Zp/de18euA+6rqx1X1fWAKuKo9pqrqxar6CXBfGytJGpNRPzn8CfAHwL+27fcDr1fVW237\nALC0tZcC+wFa/xtt/M/qx+1zorokaUxmDIckvwUcqqonz8F8ZprLpiSTSSYPHz487ulI0jvWKJ8c\nPgr8dpKXGJzyuRb4CrAoycI2ZhlwsLUPApcAtP4LgB8O14/b50T1TlXdVVWrqmrVxMTECFOXJJ2K\nGcOhqm6tqmVVtZzBBeWHq+p3gUeAT7RhG4AHW3t726b1P1xV1eo3t7uZLgVWAI8DTwAr2t1P57XX\n2H5GVidJOiULZx5yQv8FuC/JHwFPAXe3+t3AnyeZAo4w+M+eqtqT5H7geeAtYHNV/RQgyWeBncAC\nYGtV7TmNeUmSTtNJhUNV/R3wd639IoM7jY4f8y/A75xg/y8CX5ymvgPYcTJzkSSdPX5DWpLUMRwk\nSR3DQZLUMRwkSR3DQZLUMRwkSR3DQZLUMRwkSR3DQZLUMRwkSR3DQZLUMRwkSR3DQZLUMRwkSR3D\nQZLUMRwkSR3DQZLUMRwkSR3DQZLUMRwkSR3DQZLUMRwkSZ0ZwyHJe5I8nuQ7SfYk+cNWvzTJY0mm\nknwjyXmt/u62PdX6lw8d69ZWfyHJ9UP1ta02lWTLmV+mJOlkjPLJ4cfAtVV1GXA5sDbJauDLwO1V\n9UHgKLCxjd8IHG3129s4kqwEbgZ+FVgL/GmSBUkWAF8FbgBWAre0sZKkMZkxHGrgn9rmu9qjgGuB\nB1p9G3BTa69r27T+65Kk1e+rqh9X1feBKeCq9piqqher6ifAfW2sJGlMRrrm0H7Cfxo4BOwCvge8\nXlVvtSEHgKWtvRTYD9D63wDeP1w/bp8T1SVJYzJSOFTVT6vqcmAZg5/0P3RWZ3UCSTYlmUwyefjw\n4XFMQZLmhZO6W6mqXgceAa4BFiVZ2LqWAQdb+yBwCUDrvwD44XD9uH1OVJ/u9e+qqlVVtWpiYuJk\npi5JOgmj3K00kWRRa58P/Cawl0FIfKIN2wA82Nrb2zat/+Gqqla/ud3NdCmwAngceAJY0e5+Oo/B\nRevtZ2JxkqRTs3DmIVwMbGt3Ff0CcH9VPZTkeeC+JH8EPAXc3cbfDfx5kingCIP/7KmqPUnuB54H\n3gI2V9VPAZJ8FtgJLAC2VtWeM7ZCSdJJmzEcquoZ4Ipp6i8yuP5wfP1fgN85wbG+CHxxmvoOYMcI\n85UknQN+Q1qS1DEcJEkdw0GS1DEcJEkdw0GS1DEcJEkdw0GS1DEcJEkdw0GS1DEcJEkdw0GS1DEc\nJEkdw0GS1DEcJEkdw0GS1DEcJEkdw0GS1DEcJEkdw0GS1DEcJEkdw0GS1DEcJEkdw0GS1JkxHJJc\nkuSRJM8n2ZPkc61+YZJdSfa158WtniR3JJlK8kySK4eOtaGN35dkw1D9I0mebfvckSRnY7GSpNGM\n8snhLeD3q2olsBrYnGQlsAXYXVUrgN1tG+AGYEV7bALuhEGYALcBVwNXAbcdC5Q25tND+609/aVJ\nkk7VjOFQVa9U1T+29v8F9gJLgXXAtjZsG3BTa68D7q2BR4FFSS4Grgd2VdWRqjoK7ALWtr73VdWj\nVVXAvUPHkiSNwUldc0iyHLgCeAxYUlWvtK5XgSWtvRTYP7TbgVZ7u/qBaerTvf6mJJNJJg8fPnwy\nU5cknYSRwyHJLwJ/BfxeVb053Nd+4q8zPLdOVd1VVauqatXExMTZfjlJmrdGCock72IQDF+vqr9u\n5dfaKSHa86FWPwhcMrT7slZ7u/qyaeqSpDEZ5W6lAHcDe6vqj4e6tgPH7jjaADw4VF/f7lpaDbzR\nTj/tBNYkWdwuRK8Bdra+N5Osbq+1fuhYkqQxWDjCmI8C/wl4NsnTrfZfgS8B9yfZCLwMfLL17QBu\nBKaAHwGfAqiqI0m+ADzRxn2+qo609meAe4DzgW+1hyRpTGYMh6r6B+BE3zu4bprxBWw+wbG2Alun\nqU8CH55pLpKkc8NvSEuSOoaDJKljOEiSOoaDJKljOEiSOoaDJKljOEiSOoaDJKljOEiSOoaDJKlj\nOEiSOoaDJKljOEiSOoaDJKljOEiSOoaDJKljOEiSOoaDJKljOEiSOoaDJKljOEiSOoaDJKkzYzgk\n2ZrkUJLnhmoXJtmVZF97XtzqSXJHkqkkzyS5cmifDW38viQbhuofSfJs2+eOJDnTi5QknZxRPjnc\nA6w9rrYF2F1VK4DdbRvgBmBFe2wC7oRBmAC3AVcDVwG3HQuUNubTQ/sd/1qSpHNsxnCoqr8HjhxX\nXgdsa+1twE1D9Xtr4FFgUZKLgeuBXVV1pKqOAruAta3vfVX1aFUVcO/QsSRJY3Kq1xyWVNUrrf0q\nsKS1lwL7h8YdaLW3qx+Ypi5JGqPTviDdfuKvMzCXGSXZlGQyyeThw4fPxUtK0rx0quHwWjslRHs+\n1OoHgUuGxi1rtberL5umPq2ququqVlXVqomJiVOcuiRpJqcaDtuBY3ccbQAeHKqvb3ctrQbeaKef\ndgJrkixuF6LXADtb35tJVre7lNYPHUuSNCYLZxqQ5C+AXwcuSnKAwV1HXwLuT7IReBn4ZBu+A7gR\nmAJ+BHwKoKqOJPkC8EQb9/mqOnaR+zMM7og6H/hWe0iSxmjGcKiqW07Qdd00YwvYfILjbAW2TlOf\nBD480zwkSeeO35CWJHUMB0lSx3CQJHUMB0lSx3CQJHUMB0lSx3CQJHUMB0lSx3CQJHUMB0lSx3CQ\nJHUMB0lSx3CQJHUMB0lSx3CQJHUMB0lSx3CQJHUMB0lSx3CQJHUMB0lSx3CQJHUMB0lSZ9aEQ5K1\nSV5IMpVky7jnI0nz2awIhyQLgK8CNwArgVuSrBzvrCRp/poV4QBcBUxV1YtV9RPgPmDdmOckSfPW\nwnFPoFkK7B/aPgBcPaa5nDXLt/zN2F77pS99fGyvLWnumS3hMJIkm4BNbfOfkrxwCoe5CPjBmZvV\n2JzUOvLlsziT0zMv/z5muXfKWlxH7z+MOnC2hMNB4JKh7WWt9nOq6i7grtN5oSSTVbXqdI4xG7iO\n2eWdsg5456zFdZye2XLN4QlgRZJLk5wH3AxsH/OcJGnemhWfHKrqrSSfBXYCC4CtVbVnzNOSpHlr\nVoQDQFXtAHacg5c6rdNSs4jrmF3eKeuAd85aXMdpSFWN43UlSbPYbLnmIEmaReZVOMylX9GRZGuS\nQ0meG6pdmGRXkn3teXGrJ8kdbV3PJLlyfDP/eUkuSfJIkueT7EnyuVafU2tJ8p4kjyf5TlvHH7b6\npUkea/P9RruhgiTvbttTrX/5OOd/vCQLkjyV5KG2PefWkeSlJM8meTrJZKvNqfcVQJJFSR5I8t0k\ne5NcMxvWMW/CYQ7+io57gLXH1bYAu6tqBbC7bcNgTSvaYxNw5zma4yjeAn6/qlYCq4HN7c99rq3l\nx8C1VXUZcDmwNslq4MvA7VX1QeAosLGN3wgcbfXb27jZ5HPA3qHtubqO36iqy4du9Zxr7yuArwDf\nrqoPAZcx+HsZ/zqqal48gGuAnUPbtwK3jnteM8x5OfDc0PYLwMWtfTHwQmv/D+CW6cbNtgfwIPCb\nc3ktwL8D/pHBt/h/ACw8/j3G4M67a1p7YRuXcc+9zWcZg/9wrgUeAjJH1/EScNFxtTn1vgIuAL5/\n/J/pbFjHvPnkwPS/omPpmOZyqpZU1Sut/SqwpLXnxNraKYkrgMeYg2tpp2KeBg4Bu4DvAa9X1Vtt\nyPBcf7aO1v8G8P5zO+MT+hPgD4B/bdvvZ26uo4C/TfJk++0JMPfeV5cCh4E/a6f5vpbkvcyCdcyn\ncHhHqcGPDXPmVrMkvwj8FfB7VfXmcN9cWUtV/bSqLmfwk/dVwIfGPKWTluS3gENV9eS453IGfKyq\nrmRwqmVzkl8b7pwj76uFwJXAnVV1BfDP/NspJGB865hP4TDSr+iY5V5LcjFAez7U6rN6bUnexSAY\nvl5Vf93Kc3ItAFX1OvAIg9Mvi5Ic+77Q8Fx/to7WfwHww3M81el8FPjtJC8x+O3H1zI45z3X1kFV\nHWzPh4BvMgjsufa+OgAcqKrH2vYDDMJi7OuYT+HwTvgVHduBDa29gcH5+2P19e1OhtXAG0MfSccq\nSYC7gb1V9cdDXXNqLUkmkixq7fMZXDfZyyAkPtGGHb+OY+v7BPBw+wlwrKrq1qpaVlXLGfwbeLiq\nfpc5to4k703yS8fawBrgOebY+6qqXgX2J/mVVroOeJ7ZsI5xX5A5xxd/bgT+D4Nzxf9t3POZYa5/\nAbwC/D8GP11sZHCudzewD/jfwIVtbBjcifU94Flg1bjnP7SOjzH4SPwM8HR73DjX1gL8R+Cpto7n\ngP/e6r8MPA5MAX8JvLvV39O2p1r/L497DdOs6deBh+biOtp8v9Mee479e55r76s2t8uByfbe+l/A\n4tmwDr8hLUnqzKfTSpKkERkOkqSO4SBJ6hgOkqSO4SBJ6hgOkqSO4SBJ6hgOkqTO/wehk3lMa1DK\nRwAAAABJRU5ErkJggg==\n",
      "text/plain": [
       "<matplotlib.figure.Figure at 0x10a4796a0>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style>\n",
       "    .dataframe thead tr:only-child th {\n",
       "        text-align: right;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: left;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>num_business_reviewed</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>count</th>\n",
       "      <td>66639.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>mean</th>\n",
       "      <td>3.921457</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>std</th>\n",
       "      <td>10.314604</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>min</th>\n",
       "      <td>1.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10%</th>\n",
       "      <td>1.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15%</th>\n",
       "      <td>1.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20%</th>\n",
       "      <td>1.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25%</th>\n",
       "      <td>1.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>50%</th>\n",
       "      <td>1.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>60%</th>\n",
       "      <td>2.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>75%</th>\n",
       "      <td>3.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>80%</th>\n",
       "      <td>4.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>90%</th>\n",
       "      <td>7.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>95%</th>\n",
       "      <td>13.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>99%</th>\n",
       "      <td>44.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>max</th>\n",
       "      <td>609.000000</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "       num_business_reviewed\n",
       "count           66639.000000\n",
       "mean                3.921457\n",
       "std                10.314604\n",
       "min                 1.000000\n",
       "10%                 1.000000\n",
       "15%                 1.000000\n",
       "20%                 1.000000\n",
       "25%                 1.000000\n",
       "50%                 1.000000\n",
       "60%                 2.000000\n",
       "75%                 3.000000\n",
       "80%                 4.000000\n",
       "90%                 7.000000\n",
       "95%                13.000000\n",
       "99%                44.000000\n",
       "max               609.000000"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "plt.hist(user_review_count_df['num_business_reviewed'])\n",
    "plt.show()     \n",
    "display(user_review_count_df.describe(percentiles=[0.1,0.15,0.2,0.25,0.5,0.6,0.75,0.8,0.9,0.95,0.99]))\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 387,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "(11293, 2)"
      ]
     },
     "execution_count": 387,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "user_review_count_df[user_review_count_df['num_business_reviewed'] >= 5].shape"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "# for now, don't remove users.  run LPA on users with at least 5 reviews"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.6.1"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
