{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Data Science with Neo4j Using Yelp Data"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Module 2: Segmentation and Community Detection (Work in Progress)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Goal: Find communities based on categories of restaurants users review      \n",
    "\n",
    "Algorithm: Label Propagation\n",
    "\n",
    "High Level Approach:\n",
    "      \n",
    "- Subset user base to those who have reviewed restaurants in Toronto \n",
    "- Include stats to show there's enough users and reviews within this sample\n",
    "- Leverage Jesús Barrasa's taxonomy post to identify restaurant sub-categories: https://jbarrasa.com/2017/03/31/quickgraph5-learning-a-taxonomy-from-your-tagged-data/\n",
    "- Create weights between users to form tighter communities\n",
    "- Draw parallels with traditional data science clustering approaches (eg: k-means, kNN)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "from neo4j.v1 import GraphDatabase, basic_auth\n",
    "import pandas as pd\n",
    "import matplotlib.pyplot as plt"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "driver = GraphDatabase.driver(\"bolt://localhost:7687\", auth=basic_auth(\"neo4j\", \"neo4jneo4j\"))"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Part 1: Find Restaurant Sub-categories"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<Record avgCat=3.826724562629598 minCount=1 maxCat=36>\n",
      "CPU times: user 2.21 ms, sys: 2.41 ms, total: 4.62 ms\n",
      "Wall time: 1.5 s\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "# find average number of categories a business can belong to, as well as min and max\n",
    "query = \"\"\"\n",
    "        MATCH (b:Business)\n",
    "        WITH size((b)-[:IN_CATEGORY]->()) AS count\n",
    "        RETURN AVG(count) AS avgCat,  MIN(count) AS minCount, MAX(count) AS maxCat\n",
    "        \"\"\"\n",
    "\n",
    "with driver.session() as session:\n",
    "    result = session.run(query)\n",
    "\n",
    "for row in result:\n",
    "    print(row)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 73,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "# \n",
    "# note: look at distribution of categories a business belongs to in order to determine threshold to use. for now, use 5.\n",
    "#"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CPU times: user 2.63 ms, sys: 4.86 ms, total: 7.48 ms\n",
      "Wall time: 14.3 s\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "# compute co-occurence index between two categories. create relationship between two categories using co-occurence index\n",
    "query = \"\"\"\n",
    "        MATCH (c:Category) WHERE SIZE((c)<-[:IN_CATEGORY]-()) > 5 // threshold - want more than 5 businesses in a cat\n",
    "        WITH c, size((c)<-[:IN_CATEGORY]-()) as totalCount\n",
    "        MATCH (c)<-[:IN_CATEGORY]-(b)-[:IN_CATEGORY]->(relatedCategory)\n",
    "        WITH c, relatedCategory, toFloat(count(b)) / totalCount AS coocIndex\n",
    "        CREATE (c)-[:CO_OCCURS {index: coocIndex }]->(relatedCategory)\n",
    "        \"\"\"\n",
    "\n",
    "with driver.session() as session:\n",
    "    result = session.run(query)\n",
    "    "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 48,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CPU times: user 2.47 s, sys: 54.7 ms, total: 2.52 s\n",
      "Wall time: 3.78 s\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "# look at values for co-occurrence index\n",
    "query = \"\"\"\n",
    "        MATCH (c1:Category)-[r:CO_OCCURS]->(c2:Category)\n",
    "        WHERE r.index > 0\n",
    "        RETURN c1.name, c2.name, r.index\n",
    "        ORDER BY r.index DESCENDING\n",
    "        \"\"\"\n",
    "\n",
    "with driver.session() as session:\n",
    "    result = session.run(query)\n",
    "\n",
    "index_df = pd.DataFrame([dict(record) for record in result])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 49,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>c1.name</th>\n",
       "      <th>c2.name</th>\n",
       "      <th>r.index</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Hair Stylists</td>\n",
       "      <td>Hair Salons</td>\n",
       "      <td>1.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Hair Stylists</td>\n",
       "      <td>Beauty &amp; Spas</td>\n",
       "      <td>1.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Hair Salons</td>\n",
       "      <td>Beauty &amp; Spas</td>\n",
       "      <td>1.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Men's Hair Salons</td>\n",
       "      <td>Hair Salons</td>\n",
       "      <td>1.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Men's Hair Salons</td>\n",
       "      <td>Beauty &amp; Spas</td>\n",
       "      <td>1.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Blow Dry/Out Services</td>\n",
       "      <td>Beauty &amp; Spas</td>\n",
       "      <td>1.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Blow Dry/Out Services</td>\n",
       "      <td>Hair Salons</td>\n",
       "      <td>1.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Hair Extensions</td>\n",
       "      <td>Hair Salons</td>\n",
       "      <td>1.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>Hair Extensions</td>\n",
       "      <td>Beauty &amp; Spas</td>\n",
       "      <td>1.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>Departments of Motor Vehicles</td>\n",
       "      <td>Public Services &amp; Government</td>\n",
       "      <td>1.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>Sporting Goods</td>\n",
       "      <td>Shopping</td>\n",
       "      <td>1.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>American (New)</td>\n",
       "      <td>Restaurants</td>\n",
       "      <td>1.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>Bars</td>\n",
       "      <td>Nightlife</td>\n",
       "      <td>1.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>Sandwiches</td>\n",
       "      <td>Restaurants</td>\n",
       "      <td>1.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>American (Traditional)</td>\n",
       "      <td>Restaurants</td>\n",
       "      <td>1.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>Burgers</td>\n",
       "      <td>Restaurants</td>\n",
       "      <td>1.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>Italian</td>\n",
       "      <td>Restaurants</td>\n",
       "      <td>1.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>Real Estate Services</td>\n",
       "      <td>Real Estate</td>\n",
       "      <td>1.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>Real Estate Services</td>\n",
       "      <td>Home Services</td>\n",
       "      <td>1.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>Real Estate</td>\n",
       "      <td>Home Services</td>\n",
       "      <td>1.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>Property Management</td>\n",
       "      <td>Real Estate</td>\n",
       "      <td>1.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>Property Management</td>\n",
       "      <td>Home Services</td>\n",
       "      <td>1.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22</th>\n",
       "      <td>Coffee &amp; Tea</td>\n",
       "      <td>Food</td>\n",
       "      <td>1.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>23</th>\n",
       "      <td>Ice Cream &amp; Frozen Yogurt</td>\n",
       "      <td>Food</td>\n",
       "      <td>1.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>24</th>\n",
       "      <td>Auto Detailing</td>\n",
       "      <td>Automotive</td>\n",
       "      <td>1.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25</th>\n",
       "      <td>Breakfast &amp; Brunch</td>\n",
       "      <td>Restaurants</td>\n",
       "      <td>1.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>26</th>\n",
       "      <td>Gluten-Free</td>\n",
       "      <td>Restaurants</td>\n",
       "      <td>1.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>27</th>\n",
       "      <td>Self Storage</td>\n",
       "      <td>Local Services</td>\n",
       "      <td>1.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>28</th>\n",
       "      <td>Bakeries</td>\n",
       "      <td>Food</td>\n",
       "      <td>1.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>29</th>\n",
       "      <td>Bagels</td>\n",
       "      <td>Food</td>\n",
       "      <td>1.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>94817</th>\n",
       "      <td>Restaurants</td>\n",
       "      <td>Castles</td>\n",
       "      <td>0.000018</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>94818</th>\n",
       "      <td>Restaurants</td>\n",
       "      <td>Eyebrow Services</td>\n",
       "      <td>0.000018</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>94819</th>\n",
       "      <td>Restaurants</td>\n",
       "      <td>Game Meat</td>\n",
       "      <td>0.000018</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>94820</th>\n",
       "      <td>Restaurants</td>\n",
       "      <td>Family Practice</td>\n",
       "      <td>0.000018</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>94821</th>\n",
       "      <td>Restaurants</td>\n",
       "      <td>Sewing &amp; Alterations</td>\n",
       "      <td>0.000018</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>94822</th>\n",
       "      <td>Restaurants</td>\n",
       "      <td>Estate Planning Law</td>\n",
       "      <td>0.000018</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>94823</th>\n",
       "      <td>Restaurants</td>\n",
       "      <td>Handyman</td>\n",
       "      <td>0.000018</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>94824</th>\n",
       "      <td>Restaurants</td>\n",
       "      <td>Magicians</td>\n",
       "      <td>0.000018</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>94825</th>\n",
       "      <td>Restaurants</td>\n",
       "      <td>Landscape Architects</td>\n",
       "      <td>0.000018</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>94826</th>\n",
       "      <td>Restaurants</td>\n",
       "      <td>Car Share Services</td>\n",
       "      <td>0.000018</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>94827</th>\n",
       "      <td>Restaurants</td>\n",
       "      <td>Bar Crawl</td>\n",
       "      <td>0.000018</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>94828</th>\n",
       "      <td>Restaurants</td>\n",
       "      <td>Auto Insurance</td>\n",
       "      <td>0.000018</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>94829</th>\n",
       "      <td>Restaurants</td>\n",
       "      <td>Climbing</td>\n",
       "      <td>0.000018</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>94830</th>\n",
       "      <td>Restaurants</td>\n",
       "      <td>Senegalese</td>\n",
       "      <td>0.000018</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>94831</th>\n",
       "      <td>Restaurants</td>\n",
       "      <td>Paint-Your-Own Pottery</td>\n",
       "      <td>0.000018</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>94832</th>\n",
       "      <td>Restaurants</td>\n",
       "      <td>Island Pub</td>\n",
       "      <td>0.000018</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>94833</th>\n",
       "      <td>Restaurants</td>\n",
       "      <td>Go Karts</td>\n",
       "      <td>0.000018</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>94834</th>\n",
       "      <td>Restaurants</td>\n",
       "      <td>Formal Wear</td>\n",
       "      <td>0.000018</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>94835</th>\n",
       "      <td>Restaurants</td>\n",
       "      <td>Adult</td>\n",
       "      <td>0.000018</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>94836</th>\n",
       "      <td>Restaurants</td>\n",
       "      <td>Teeth Whitening</td>\n",
       "      <td>0.000018</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>94837</th>\n",
       "      <td>Restaurants</td>\n",
       "      <td>Waxing</td>\n",
       "      <td>0.000018</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>94838</th>\n",
       "      <td>Restaurants</td>\n",
       "      <td>Aircraft Repairs</td>\n",
       "      <td>0.000018</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>94839</th>\n",
       "      <td>Restaurants</td>\n",
       "      <td>Club Crawl</td>\n",
       "      <td>0.000018</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>94840</th>\n",
       "      <td>Restaurants</td>\n",
       "      <td>Traditional Norwegian</td>\n",
       "      <td>0.000018</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>94841</th>\n",
       "      <td>Restaurants</td>\n",
       "      <td>Sailing</td>\n",
       "      <td>0.000018</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>94842</th>\n",
       "      <td>Restaurants</td>\n",
       "      <td>Udon</td>\n",
       "      <td>0.000018</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>94843</th>\n",
       "      <td>Restaurants</td>\n",
       "      <td>Mailbox Centers</td>\n",
       "      <td>0.000018</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>94844</th>\n",
       "      <td>Restaurants</td>\n",
       "      <td>Conveyor Belt Sushi</td>\n",
       "      <td>0.000018</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>94845</th>\n",
       "      <td>Restaurants</td>\n",
       "      <td>Mobile Phone Repair</td>\n",
       "      <td>0.000018</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>94846</th>\n",
       "      <td>Restaurants</td>\n",
       "      <td>Furniture Reupholstery</td>\n",
       "      <td>0.000018</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>94847 rows × 3 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                             c1.name                       c2.name   r.index\n",
       "0                      Hair Stylists                   Hair Salons  1.000000\n",
       "1                      Hair Stylists                 Beauty & Spas  1.000000\n",
       "2                        Hair Salons                 Beauty & Spas  1.000000\n",
       "3                  Men's Hair Salons                   Hair Salons  1.000000\n",
       "4                  Men's Hair Salons                 Beauty & Spas  1.000000\n",
       "5              Blow Dry/Out Services                 Beauty & Spas  1.000000\n",
       "6              Blow Dry/Out Services                   Hair Salons  1.000000\n",
       "7                    Hair Extensions                   Hair Salons  1.000000\n",
       "8                    Hair Extensions                 Beauty & Spas  1.000000\n",
       "9      Departments of Motor Vehicles  Public Services & Government  1.000000\n",
       "10                    Sporting Goods                      Shopping  1.000000\n",
       "11                    American (New)                   Restaurants  1.000000\n",
       "12                              Bars                     Nightlife  1.000000\n",
       "13                        Sandwiches                   Restaurants  1.000000\n",
       "14            American (Traditional)                   Restaurants  1.000000\n",
       "15                           Burgers                   Restaurants  1.000000\n",
       "16                           Italian                   Restaurants  1.000000\n",
       "17              Real Estate Services                   Real Estate  1.000000\n",
       "18              Real Estate Services                 Home Services  1.000000\n",
       "19                       Real Estate                 Home Services  1.000000\n",
       "20               Property Management                   Real Estate  1.000000\n",
       "21               Property Management                 Home Services  1.000000\n",
       "22                      Coffee & Tea                          Food  1.000000\n",
       "23         Ice Cream & Frozen Yogurt                          Food  1.000000\n",
       "24                    Auto Detailing                    Automotive  1.000000\n",
       "25                Breakfast & Brunch                   Restaurants  1.000000\n",
       "26                       Gluten-Free                   Restaurants  1.000000\n",
       "27                      Self Storage                Local Services  1.000000\n",
       "28                          Bakeries                          Food  1.000000\n",
       "29                            Bagels                          Food  1.000000\n",
       "...                              ...                           ...       ...\n",
       "94817                    Restaurants                       Castles  0.000018\n",
       "94818                    Restaurants              Eyebrow Services  0.000018\n",
       "94819                    Restaurants                     Game Meat  0.000018\n",
       "94820                    Restaurants               Family Practice  0.000018\n",
       "94821                    Restaurants          Sewing & Alterations  0.000018\n",
       "94822                    Restaurants           Estate Planning Law  0.000018\n",
       "94823                    Restaurants                      Handyman  0.000018\n",
       "94824                    Restaurants                     Magicians  0.000018\n",
       "94825                    Restaurants          Landscape Architects  0.000018\n",
       "94826                    Restaurants            Car Share Services  0.000018\n",
       "94827                    Restaurants                     Bar Crawl  0.000018\n",
       "94828                    Restaurants                Auto Insurance  0.000018\n",
       "94829                    Restaurants                      Climbing  0.000018\n",
       "94830                    Restaurants                    Senegalese  0.000018\n",
       "94831                    Restaurants        Paint-Your-Own Pottery  0.000018\n",
       "94832                    Restaurants                    Island Pub  0.000018\n",
       "94833                    Restaurants                      Go Karts  0.000018\n",
       "94834                    Restaurants                   Formal Wear  0.000018\n",
       "94835                    Restaurants                         Adult  0.000018\n",
       "94836                    Restaurants               Teeth Whitening  0.000018\n",
       "94837                    Restaurants                        Waxing  0.000018\n",
       "94838                    Restaurants              Aircraft Repairs  0.000018\n",
       "94839                    Restaurants                    Club Crawl  0.000018\n",
       "94840                    Restaurants         Traditional Norwegian  0.000018\n",
       "94841                    Restaurants                       Sailing  0.000018\n",
       "94842                    Restaurants                          Udon  0.000018\n",
       "94843                    Restaurants               Mailbox Centers  0.000018\n",
       "94844                    Restaurants           Conveyor Belt Sushi  0.000018\n",
       "94845                    Restaurants           Mobile Phone Repair  0.000018\n",
       "94846                    Restaurants        Furniture Reupholstery  0.000018\n",
       "\n",
       "[94847 rows x 3 columns]"
      ]
     },
     "execution_count": 49,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "index_df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 47,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CPU times: user 2.75 ms, sys: 2.99 ms, total: 5.74 ms\n",
      "Wall time: 18.2 s\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "## case 1:  bi-directional co-occurrence is 1\n",
    "query = \"\"\"\n",
    "        MATCH (c1)-[co1:CO_OCCURS {index : 1}]->(c2),\n",
    "        (c2)-[co2:CO_OCCURS { index: 1}]->(c1)\n",
    "        WHERE ID(c1) > ID(c2)\n",
    "        MERGE (c1)-[:SAME_AS]-(c2)\n",
    "        \"\"\"\n",
    "\n",
    "with driver.session() as session:\n",
    "    result = session.run(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 54,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CPU times: user 2.83 ms, sys: 2.34 ms, total: 5.17 ms\n",
      "Wall time: 9.98 ms\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "# look at categories that are the same \n",
    "query = \"\"\"\n",
    "        MATCH (c1:Category)-[r:SAME_AS]->(c2:Category)\n",
    "        RETURN c1.name, c2.name\n",
    "        \"\"\"\n",
    "\n",
    "with driver.session() as session:\n",
    "    result = session.run(query)\n",
    "\n",
    "same_df = pd.DataFrame([dict(record) for record in result])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 55,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>c1.name</th>\n",
       "      <th>c2.name</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Mags</td>\n",
       "      <td>Books</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Music &amp; Video</td>\n",
       "      <td>Mags</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Music &amp; Video</td>\n",
       "      <td>Books</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Wine &amp; Spirits</td>\n",
       "      <td>Beer</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Vintage &amp; Consignment</td>\n",
       "      <td>Used</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Trusts</td>\n",
       "      <td>Wills</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>&amp; Probates</td>\n",
       "      <td>Trusts</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>&amp; Probates</td>\n",
       "      <td>Wills</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                 c1.name c2.name\n",
       "0                   Mags   Books\n",
       "1          Music & Video    Mags\n",
       "2          Music & Video   Books\n",
       "3         Wine & Spirits    Beer\n",
       "4  Vintage & Consignment    Used\n",
       "5                 Trusts   Wills\n",
       "6             & Probates  Trusts\n",
       "7             & Probates   Wills"
      ]
     },
     "execution_count": 55,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "same_df  "
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "only 7 records returned above"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 57,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CPU times: user 2.12 ms, sys: 3.13 ms, total: 5.25 ms\n",
      "Wall time: 11.7 s\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "query = \"\"\"\n",
    "        MATCH (c1)-[co1:CO_OCCURS]->(c2), \n",
    "              (c2)-[co2:CO_OCCURS]->(c1)\n",
    "        WHERE ID(c1) > ID(c2) \n",
    "          AND co1.index = 1 \n",
    "          AND co2.index < 1 \n",
    "        MERGE (c1)-[:NARROWER_THAN]->(c2)\n",
    "        \"\"\"\n",
    "\n",
    "with driver.session() as session:\n",
    "    result = session.run(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 58,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CPU times: user 44.1 ms, sys: 3.58 ms, total: 47.7 ms\n",
      "Wall time: 59.4 ms\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "# look at categories that are NARROWER_THAN other categories\n",
    "query = \"\"\"\n",
    "        MATCH (c1:Category)-[r:NARROWER_THAN]->(c2:Category)\n",
    "        RETURN c1.name, c2.name\n",
    "        \"\"\"\n",
    "\n",
    "with driver.session() as session:\n",
    "    result = session.run(query)\n",
    "\n",
    "narrower_df = pd.DataFrame([dict(record) for record in result])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 59,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>c1.name</th>\n",
       "      <th>c2.name</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Men's Hair Salons</td>\n",
       "      <td>Hair Salons</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Blow Dry/Out Services</td>\n",
       "      <td>Hair Salons</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Hair Extensions</td>\n",
       "      <td>Hair Salons</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Bars</td>\n",
       "      <td>Nightlife</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Italian</td>\n",
       "      <td>Restaurants</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Property Management</td>\n",
       "      <td>Home Services</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Property Management</td>\n",
       "      <td>Real Estate</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Auto Detailing</td>\n",
       "      <td>Automotive</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>Breakfast &amp; Brunch</td>\n",
       "      <td>Restaurants</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>Gluten-Free</td>\n",
       "      <td>Restaurants</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>Self Storage</td>\n",
       "      <td>Local Services</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>Bakeries</td>\n",
       "      <td>Food</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>Bagels</td>\n",
       "      <td>Food</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>Endodontists</td>\n",
       "      <td>Dentists</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>Cosmetic Dentists</td>\n",
       "      <td>Dentists</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>Orthodontists</td>\n",
       "      <td>Dentists</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>Orthodontists</td>\n",
       "      <td>Health &amp; Medical</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>French</td>\n",
       "      <td>Restaurants</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>Nail Salons</td>\n",
       "      <td>Beauty &amp; Spas</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>Tires</td>\n",
       "      <td>Automotive</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>Oil Change Stations</td>\n",
       "      <td>Automotive</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>Auto Repair</td>\n",
       "      <td>Automotive</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22</th>\n",
       "      <td>Barbers</td>\n",
       "      <td>Beauty &amp; Spas</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>23</th>\n",
       "      <td>Books</td>\n",
       "      <td>Shopping</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>24</th>\n",
       "      <td>Mags</td>\n",
       "      <td>Shopping</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25</th>\n",
       "      <td>Music &amp; Video</td>\n",
       "      <td>Shopping</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>26</th>\n",
       "      <td>Music &amp; DVDs</td>\n",
       "      <td>Mags</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>27</th>\n",
       "      <td>Music &amp; DVDs</td>\n",
       "      <td>Shopping</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>28</th>\n",
       "      <td>Music &amp; DVDs</td>\n",
       "      <td>Books</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>29</th>\n",
       "      <td>Music &amp; DVDs</td>\n",
       "      <td>Music &amp; Video</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1392</th>\n",
       "      <td>Product Design</td>\n",
       "      <td>Professional Services</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1393</th>\n",
       "      <td>Mediators</td>\n",
       "      <td>Professional Services</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1394</th>\n",
       "      <td>Drive-In Theater</td>\n",
       "      <td>Arts &amp; Entertainment</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1395</th>\n",
       "      <td>Drive-In Theater</td>\n",
       "      <td>Cinema</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1396</th>\n",
       "      <td>Ice Delivery</td>\n",
       "      <td>Local Services</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1397</th>\n",
       "      <td>Visitor Centers</td>\n",
       "      <td>Hotels &amp; Travel</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1398</th>\n",
       "      <td>Visitor Centers</td>\n",
       "      <td>Travel Services</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1399</th>\n",
       "      <td>Bar Crawl</td>\n",
       "      <td>Nightlife</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1400</th>\n",
       "      <td>Bavarian</td>\n",
       "      <td>Restaurants</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1401</th>\n",
       "      <td>Attraction Farms</td>\n",
       "      <td>Farms</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1402</th>\n",
       "      <td>Attraction Farms</td>\n",
       "      <td>Arts &amp; Entertainment</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1403</th>\n",
       "      <td>Perfume</td>\n",
       "      <td>Beauty &amp; Spas</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1404</th>\n",
       "      <td>Perfume</td>\n",
       "      <td>Shopping</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1405</th>\n",
       "      <td>Hydroponics</td>\n",
       "      <td>Home &amp; Garden</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1406</th>\n",
       "      <td>Hydroponics</td>\n",
       "      <td>Nurseries &amp; Gardening</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1407</th>\n",
       "      <td>Hydroponics</td>\n",
       "      <td>Shopping</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1408</th>\n",
       "      <td>Shanghainese</td>\n",
       "      <td>Restaurants</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1409</th>\n",
       "      <td>Shanghainese</td>\n",
       "      <td>Chinese</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1410</th>\n",
       "      <td>Horse Racing</td>\n",
       "      <td>Active Life</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1411</th>\n",
       "      <td>Aerial Tours</td>\n",
       "      <td>Tours</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1412</th>\n",
       "      <td>Aerial Tours</td>\n",
       "      <td>Hotels &amp; Travel</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1413</th>\n",
       "      <td>Planetarium</td>\n",
       "      <td>Arts &amp; Entertainment</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1414</th>\n",
       "      <td>Gunsmith</td>\n",
       "      <td>Local Services</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1415</th>\n",
       "      <td>Surfing</td>\n",
       "      <td>Active Life</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1416</th>\n",
       "      <td>Cannabis Tours</td>\n",
       "      <td>Cannabis Clinics</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1417</th>\n",
       "      <td>Cannabis Tours</td>\n",
       "      <td>Health &amp; Medical</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1418</th>\n",
       "      <td>Public Markets</td>\n",
       "      <td>Shopping</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1419</th>\n",
       "      <td>Public Markets</td>\n",
       "      <td>Food</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1420</th>\n",
       "      <td>Public Markets</td>\n",
       "      <td>Farmers Market</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1421</th>\n",
       "      <td>Herbal Shops</td>\n",
       "      <td>Health &amp; Medical</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>1422 rows × 2 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                    c1.name                c2.name\n",
       "0         Men's Hair Salons            Hair Salons\n",
       "1     Blow Dry/Out Services            Hair Salons\n",
       "2           Hair Extensions            Hair Salons\n",
       "3                      Bars              Nightlife\n",
       "4                   Italian            Restaurants\n",
       "5       Property Management          Home Services\n",
       "6       Property Management            Real Estate\n",
       "7            Auto Detailing             Automotive\n",
       "8        Breakfast & Brunch            Restaurants\n",
       "9               Gluten-Free            Restaurants\n",
       "10             Self Storage         Local Services\n",
       "11                 Bakeries                   Food\n",
       "12                   Bagels                   Food\n",
       "13             Endodontists               Dentists\n",
       "14        Cosmetic Dentists               Dentists\n",
       "15            Orthodontists               Dentists\n",
       "16            Orthodontists       Health & Medical\n",
       "17                   French            Restaurants\n",
       "18              Nail Salons          Beauty & Spas\n",
       "19                    Tires             Automotive\n",
       "20      Oil Change Stations             Automotive\n",
       "21              Auto Repair             Automotive\n",
       "22                  Barbers          Beauty & Spas\n",
       "23                    Books               Shopping\n",
       "24                     Mags               Shopping\n",
       "25            Music & Video               Shopping\n",
       "26             Music & DVDs                   Mags\n",
       "27             Music & DVDs               Shopping\n",
       "28             Music & DVDs                  Books\n",
       "29             Music & DVDs          Music & Video\n",
       "...                     ...                    ...\n",
       "1392         Product Design  Professional Services\n",
       "1393              Mediators  Professional Services\n",
       "1394       Drive-In Theater   Arts & Entertainment\n",
       "1395       Drive-In Theater                 Cinema\n",
       "1396           Ice Delivery         Local Services\n",
       "1397        Visitor Centers        Hotels & Travel\n",
       "1398        Visitor Centers        Travel Services\n",
       "1399              Bar Crawl              Nightlife\n",
       "1400               Bavarian            Restaurants\n",
       "1401       Attraction Farms                  Farms\n",
       "1402       Attraction Farms   Arts & Entertainment\n",
       "1403                Perfume          Beauty & Spas\n",
       "1404                Perfume               Shopping\n",
       "1405            Hydroponics          Home & Garden\n",
       "1406            Hydroponics  Nurseries & Gardening\n",
       "1407            Hydroponics               Shopping\n",
       "1408           Shanghainese            Restaurants\n",
       "1409           Shanghainese                Chinese\n",
       "1410           Horse Racing            Active Life\n",
       "1411           Aerial Tours                  Tours\n",
       "1412           Aerial Tours        Hotels & Travel\n",
       "1413            Planetarium   Arts & Entertainment\n",
       "1414               Gunsmith         Local Services\n",
       "1415                Surfing            Active Life\n",
       "1416         Cannabis Tours       Cannabis Clinics\n",
       "1417         Cannabis Tours       Health & Medical\n",
       "1418         Public Markets               Shopping\n",
       "1419         Public Markets                   Food\n",
       "1420         Public Markets         Farmers Market\n",
       "1421           Herbal Shops       Health & Medical\n",
       "\n",
       "[1422 rows x 2 columns]"
      ]
     },
     "execution_count": 59,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "narrower_df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 63,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<Record num_transitive_relationships=0>\n",
      "CPU times: user 2.84 ms, sys: 3.34 ms, total: 6.18 ms\n",
      "Wall time: 12.2 s\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "# check number of transitive relationships\n",
    "query = \"\"\"\n",
    "        MATCH (c1)-[:NARROWER_THAN*2..]->(c3), \n",
    "        (c1)-[d:NARROWER_THAN]->(c3)\n",
    "        RETURN COUNT(d) AS  num_transitive_relationships\n",
    "        \"\"\"\n",
    "\n",
    "with driver.session() as session:\n",
    "    result = session.run(query)\n",
    "    \n",
    "for row in result:\n",
    "    print(row)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "%%time\n",
    "# since there are no transitive relationships, no need to delete redundant relationships\n",
    "#query = \"\"\"\n",
    "#        MATCH (c1)-[:NARROWER_THAN*2..]->(c3), \n",
    "#        (c1)-[d:NARROWER_THAN]->(c3)\n",
    "#        DELETE d\n",
    "#        \"\"\"\n",
    "\n",
    "with driver.session() as session:\n",
    "    result = session.run(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 67,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CPU times: user 8.24 ms, sys: 3.21 ms, total: 11.5 ms\n",
      "Wall time: 70.3 ms\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "# get a list of categories that are narrower than the \"Restaurants\" category\n",
    "query = \"\"\"\n",
    "        MATCH (c1:Category{name: \"Restaurants\"})<-[:NARROWER_THAN]-(c2:Category)\n",
    "        RETURN c1.name, c2.name\n",
    "        \"\"\"\n",
    "\n",
    "with driver.session() as session:\n",
    "    result = session.run(query)\n",
    "\n",
    "restaurants_narrower_df = pd.DataFrame([dict(record) for record in result])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 68,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>c1.name</th>\n",
       "      <th>c2.name</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Restaurants</td>\n",
       "      <td>Hawaiian</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Restaurants</td>\n",
       "      <td>Cheesesteaks</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Restaurants</td>\n",
       "      <td>Middle Eastern</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Restaurants</td>\n",
       "      <td>Tapas Bars</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Restaurants</td>\n",
       "      <td>Himalayan/Nepalese</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Restaurants</td>\n",
       "      <td>Live/Raw Food</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Restaurants</td>\n",
       "      <td>Cajun/Creole</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Restaurants</td>\n",
       "      <td>Fish &amp; Chips</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>Restaurants</td>\n",
       "      <td>Poutineries</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>Restaurants</td>\n",
       "      <td>Irish</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>Restaurants</td>\n",
       "      <td>Pakistani</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>Restaurants</td>\n",
       "      <td>Latin American</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>Restaurants</td>\n",
       "      <td>Chicken Shop</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>Restaurants</td>\n",
       "      <td>Halal</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>Restaurants</td>\n",
       "      <td>Southern</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>Restaurants</td>\n",
       "      <td>Hungarian</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>Restaurants</td>\n",
       "      <td>Korean</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>Restaurants</td>\n",
       "      <td>Modern European</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>Restaurants</td>\n",
       "      <td>Belgian</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>Restaurants</td>\n",
       "      <td>Vegetarian</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>Restaurants</td>\n",
       "      <td>International</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>Restaurants</td>\n",
       "      <td>Steakhouses</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22</th>\n",
       "      <td>Restaurants</td>\n",
       "      <td>Noodles</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>23</th>\n",
       "      <td>Restaurants</td>\n",
       "      <td>Hot Dogs</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>24</th>\n",
       "      <td>Restaurants</td>\n",
       "      <td>Tex-Mex</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25</th>\n",
       "      <td>Restaurants</td>\n",
       "      <td>Greek</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>26</th>\n",
       "      <td>Restaurants</td>\n",
       "      <td>Vietnamese</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>27</th>\n",
       "      <td>Restaurants</td>\n",
       "      <td>German</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>28</th>\n",
       "      <td>Restaurants</td>\n",
       "      <td>Creperies</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>29</th>\n",
       "      <td>Restaurants</td>\n",
       "      <td>Buffets</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>86</th>\n",
       "      <td>Restaurants</td>\n",
       "      <td>Bangladeshi</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>87</th>\n",
       "      <td>Restaurants</td>\n",
       "      <td>Spanish</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>88</th>\n",
       "      <td>Restaurants</td>\n",
       "      <td>Brazilian</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>89</th>\n",
       "      <td>Restaurants</td>\n",
       "      <td>Beer Garden</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>90</th>\n",
       "      <td>Restaurants</td>\n",
       "      <td>Hot Pot</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>91</th>\n",
       "      <td>Restaurants</td>\n",
       "      <td>Fondue</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>92</th>\n",
       "      <td>Restaurants</td>\n",
       "      <td>Mongolian</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>93</th>\n",
       "      <td>Restaurants</td>\n",
       "      <td>Soul Food</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>94</th>\n",
       "      <td>Restaurants</td>\n",
       "      <td>Arabian</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>95</th>\n",
       "      <td>Restaurants</td>\n",
       "      <td>Kebab</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>96</th>\n",
       "      <td>Restaurants</td>\n",
       "      <td>Bistros</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>97</th>\n",
       "      <td>Restaurants</td>\n",
       "      <td>Persian/Iranian</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>98</th>\n",
       "      <td>Restaurants</td>\n",
       "      <td>Swabian</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>99</th>\n",
       "      <td>Restaurants</td>\n",
       "      <td>Curry Sausage</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>100</th>\n",
       "      <td>Restaurants</td>\n",
       "      <td>Turkish</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>101</th>\n",
       "      <td>Restaurants</td>\n",
       "      <td>Pan Asian</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>102</th>\n",
       "      <td>Restaurants</td>\n",
       "      <td>Filipino</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>103</th>\n",
       "      <td>Restaurants</td>\n",
       "      <td>Eatertainment</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>104</th>\n",
       "      <td>Restaurants</td>\n",
       "      <td>Polish</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>105</th>\n",
       "      <td>Restaurants</td>\n",
       "      <td>Russian</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>106</th>\n",
       "      <td>Restaurants</td>\n",
       "      <td>Ethiopian</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>107</th>\n",
       "      <td>Restaurants</td>\n",
       "      <td>Food Stands</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>108</th>\n",
       "      <td>Restaurants</td>\n",
       "      <td>Afghan</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>109</th>\n",
       "      <td>Restaurants</td>\n",
       "      <td>African</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>110</th>\n",
       "      <td>Restaurants</td>\n",
       "      <td>Taiwanese</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>111</th>\n",
       "      <td>Restaurants</td>\n",
       "      <td>Malaysian</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>112</th>\n",
       "      <td>Restaurants</td>\n",
       "      <td>Scottish</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>113</th>\n",
       "      <td>Restaurants</td>\n",
       "      <td>Brasseries</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>114</th>\n",
       "      <td>Restaurants</td>\n",
       "      <td>Kosher</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>115</th>\n",
       "      <td>Restaurants</td>\n",
       "      <td>Portuguese</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>116 rows × 2 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "         c1.name             c2.name\n",
       "0    Restaurants            Hawaiian\n",
       "1    Restaurants        Cheesesteaks\n",
       "2    Restaurants      Middle Eastern\n",
       "3    Restaurants          Tapas Bars\n",
       "4    Restaurants  Himalayan/Nepalese\n",
       "5    Restaurants       Live/Raw Food\n",
       "6    Restaurants        Cajun/Creole\n",
       "7    Restaurants        Fish & Chips\n",
       "8    Restaurants         Poutineries\n",
       "9    Restaurants               Irish\n",
       "10   Restaurants           Pakistani\n",
       "11   Restaurants      Latin American\n",
       "12   Restaurants        Chicken Shop\n",
       "13   Restaurants               Halal\n",
       "14   Restaurants            Southern\n",
       "15   Restaurants           Hungarian\n",
       "16   Restaurants              Korean\n",
       "17   Restaurants     Modern European\n",
       "18   Restaurants             Belgian\n",
       "19   Restaurants          Vegetarian\n",
       "20   Restaurants       International\n",
       "21   Restaurants         Steakhouses\n",
       "22   Restaurants             Noodles\n",
       "23   Restaurants            Hot Dogs\n",
       "24   Restaurants             Tex-Mex\n",
       "25   Restaurants               Greek\n",
       "26   Restaurants          Vietnamese\n",
       "27   Restaurants              German\n",
       "28   Restaurants           Creperies\n",
       "29   Restaurants             Buffets\n",
       "..           ...                 ...\n",
       "86   Restaurants         Bangladeshi\n",
       "87   Restaurants             Spanish\n",
       "88   Restaurants           Brazilian\n",
       "89   Restaurants         Beer Garden\n",
       "90   Restaurants             Hot Pot\n",
       "91   Restaurants              Fondue\n",
       "92   Restaurants           Mongolian\n",
       "93   Restaurants           Soul Food\n",
       "94   Restaurants             Arabian\n",
       "95   Restaurants               Kebab\n",
       "96   Restaurants             Bistros\n",
       "97   Restaurants     Persian/Iranian\n",
       "98   Restaurants             Swabian\n",
       "99   Restaurants       Curry Sausage\n",
       "100  Restaurants             Turkish\n",
       "101  Restaurants           Pan Asian\n",
       "102  Restaurants            Filipino\n",
       "103  Restaurants       Eatertainment\n",
       "104  Restaurants              Polish\n",
       "105  Restaurants             Russian\n",
       "106  Restaurants           Ethiopian\n",
       "107  Restaurants         Food Stands\n",
       "108  Restaurants              Afghan\n",
       "109  Restaurants             African\n",
       "110  Restaurants           Taiwanese\n",
       "111  Restaurants           Malaysian\n",
       "112  Restaurants            Scottish\n",
       "113  Restaurants          Brasseries\n",
       "114  Restaurants              Kosher\n",
       "115  Restaurants          Portuguese\n",
       "\n",
       "[116 rows x 2 columns]"
      ]
     },
     "execution_count": 68,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "restaurants_narrower_df"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Part 2: Label Propagation to Detect Communities"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "%%time\n",
    "# before running label propagation, define similarity between user pairs using Jaccard index\n",
    "# this will be used as the weight for Label Propagation\n",
    "# numerator: count of categories that they've reviewed together\n",
    "# denominator: count of categories between the two of them\n",
    "# criteria: business has to be restaurant in Toronto\n",
    "# for now, keep calculation simple.  room for improvement later (ie: take into account # businesses in each category)\n",
    "\n",
    "query = \"\"\"\n",
    "        // Get user pairs and count of distinct restaurant categories that they have both reviewed\n",
    "        MATCH (u1:User)-[:WROTE]->(r1:Review)-[:REVIEW_OF]->(b1:Business)-[:IN_CATEGORY]->(c:Category),\n",
    "              (u2:User)-[:WROTE]->(r2:Review)-[:REVIEW_OF]->(b2:Business)-[:IN_CATEGORY]->(c),\n",
    "              (b1)-[:IN_CITY]->(:City {name: \"Toronto\"})<-[:IN_CITY]-(b2),\n",
    "              (c)-[:NARROWER_THAN]->(:Category{name: \"Restaurants\"})\n",
    "        WHERE u1 <> u2\n",
    "        RETURN u1, u2, COUNT(DISTINCT c) as intersection_count\n",
    "\n",
    "        // Get count of all the distinct categories that they have reviewed between them\n",
    "        //MATCH (u:User)-[:WROTE]->(r:Review)-[:REVIEW_OF]->(b:Business)-[:IN_CATEGORY]->(c:Category),\n",
    "        //WHERE u in [u1, u2]\n",
    "        //WITH u1, u2, intersection_count, COUNT(DISTINCT c) as union_count\n",
    "\n",
    "        // Compute Jaccard index and store it as relationship between u1 and u2\n",
    "        //WITH u1, u2, intersection_count, union_count, (intersection_count*1.0/union_count) as jaccard_index\n",
    "        //CREATE (u1)-[s:SIMILAR_TO]-(u2)\n",
    "        //SET s.jaccard_index = jaccard_index\n",
    "        \"\"\"\n",
    "\n",
    "with driver.session() as session:\n",
    "    result = session.run(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "jaccard_df = pd.DataFrame([dict(record) for record in result])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 92,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<Record nodes=6764792 iterations=10 loadMillis=29382 computeMillis=25497 writeMillis=39893 write=True partitionProperty='partition'>\n",
      "CPU times: user 6.12 ms, sys: 9.46 ms, total: 15.6 ms\n",
      "Wall time: 1min 34s\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "# incorporate weights between user pairs in order to create tighter communities\n",
    "# weightProperty - Jaccard index\n",
    "# subset to Restaurants in Toronto only\n",
    "query = \"\"\"\n",
    "        CALL algo.labelPropagation(\n",
    "            'MATCH (u:User)-[:WROTE]->(:Review)-[:REVIEW_OF]->(:Business)-[:IN_CITY]->(:City {name:\"Toronto\"}) RETURN id(u) as id',   \n",
    "            \n",
    "            'MATCH (u1:User)-[:WROTE]->(r1:Review)-[:REVIEW_OF]->(b1:Business)-[:IN_CATEGORY]->(c:Category),\n",
    "                   (u2:User)-[:WROTE]->(r2:Review)-[:REVIEW_OF]->(b2:Business)-[:IN_CATEGORY]->(c),\n",
    "                   (b1)-[:IN_CITY]->(:City {name: \"Toronto\"})<-[:IN_CITY]-(b2),\n",
    "                   (:Category{name: \"Restaurants\"})<-[:NARROWER_THAN]-(c)\n",
    "\n",
    "             RETURN DISTINCT id(u1) as source, id(u2) as target', \n",
    "             'OUTGOING',\n",
    "            {graph: 'cypher', iterations:10, partitionProperty:'partition', write: true})\n",
    "        YIELD nodes, iterations, loadMillis, computeMillis, writeMillis, write, partitionProperty;\n",
    "        \"\"\"\n",
    "\n",
    "with driver.session() as session:\n",
    "    result = session.run(query)\n",
    "    \n",
    "for row in result:\n",
    "    print(row)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 96,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<Record count(n)=6764792>\n",
      "CPU times: user 2.14 ms, sys: 2.71 ms, total: 4.85 ms\n",
      "Wall time: 12.9 ms\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "# check number of nodes\n",
    "query = \"\"\"\n",
    "        MATCH (n)\n",
    "        RETURN count(n)\n",
    "        \"\"\"\n",
    "\n",
    "with driver.session() as session:\n",
    "    result = session.run(query)\n",
    "    \n",
    "for row in result:\n",
    "    print(row)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 99,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<Record count(u)=430985>\n",
      "CPU times: user 2.89 ms, sys: 5.25 ms, total: 8.15 ms\n",
      "Wall time: 6.56 s\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "# check number of qualifying user nodes (ie: users who reviewed businesses in Toronto)\n",
    "query = \"\"\"\n",
    "        MATCH (u:User)-[:WROTE]->(:Review)-[:REVIEW_OF]->(:Business)-[:IN_CITY]->(:City {name:\"Toronto\"})\n",
    "        RETURN count(u)\n",
    "        \"\"\"\n",
    "\n",
    "with driver.session() as session:\n",
    "    result = session.run(query)\n",
    "    \n",
    "for row in result:\n",
    "    print(row)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 100,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<Record count(DISTINCT u.partition)=872>\n",
      "CPU times: user 2.39 ms, sys: 3.24 ms, total: 5.63 ms\n",
      "Wall time: 1.99 s\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "# check number of communities\n",
    "query = \"\"\"\n",
    "        MATCH (u:User)\n",
    "        RETURN count(DISTINCT u.partition)\n",
    "        \"\"\"\n",
    "\n",
    "with driver.session() as session:\n",
    "    result = session.run(query)\n",
    "\n",
    "for row in result:\n",
    "    print(row)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 101,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<Record count(DISTINCT b.partition)=196>\n",
      "CPU times: user 2.04 ms, sys: 3.18 ms, total: 5.23 ms\n",
      "Wall time: 358 ms\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "# check number of business partitions????\n",
    "query = \"\"\"\n",
    "        MATCH (b:Business)\n",
    "        RETURN count(DISTINCT b.partition)\n",
    "        \"\"\"\n",
    "\n",
    "with driver.session() as session:\n",
    "    result = session.run(query)\n",
    "\n",
    "for row in result:\n",
    "    print(row)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "%%time\n",
    "# remove partition\n",
    "query = \"\"\"\n",
    "        MATCH (n:Review)\n",
    "        REMOVE n.partition \n",
    "        RETURN n\n",
    "        \"\"\"\n",
    "\n",
    "with driver.session() as session:\n",
    "    result = session.run(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.6.1"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
